
# State **`s3://infrahouse-website-infra/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       3 |          4 |           1 |
## Affected resources by action

|  Action  | Resources                                                             |
|:--------:|:----------------------------------------------------------------------|
|    🟢     | `module.website.aws_acm_certificate_validation.website`               |
|    🟢     | `module.website.aws_route53_record.cert_validation["infrahouse.com"]` |
|    🟡     | `module.website.aws_autoscaling_group.website`                        |
|    🟡     | `module.website.aws_launch_template.website`                          |
|    🟡     | `module.website.aws_lb_listener.ssl`                                  |
|    🟡     | `module.website.aws_route53_record.apex[0]`                           |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/db7cc2e6-2511-4a6d-af77-2097fb7d70d2/terraform-bin plan -no-color --out=tf.plan
data.aws_iam_policy_document.webserver_permissions: Reading...
data.aws_iam_policy_document.webserver_permissions: Read complete after 0s [id=2218315402]
module.cdn.aws_acm_certificate.cdn: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/a09201ea-e83d-43ab-8abd-75004b7d5aa5]
module.cdn.data.aws_route53_zone.ih_com: Reading...
data.aws_key_pair.aleks: Reading...
module.website.module.webserver_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/webserver20230818170808801500000002]
data.aws_ami.ubuntu_22: Reading...
module.website.data.aws_caller_identity.current: Reading...
data.aws_availability_zones.uw1: Reading...
module.website-vpc.data.aws_vpc.management_vpc[0]: Reading...
module.website.module.webserver_profile.data.aws_iam_policy_document.assume: Reading...
module.website-vpc.aws_vpc.vpc: Refreshing state... [id=vpc-0ae798f941be45345]
module.cdn.aws_cloudfront_cache_policy.default: Refreshing state... [id=ea742fff-3eb3-4437-bfce-2ef431afcfcc]
module.website.module.webserver_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]
module.webserver_userdata.data.aws_region.current: Reading...
module.webserver_userdata.data.aws_region.current: Read complete after 0s [id=us-west-1]
data.aws_route53_zone.infrahouse_com: Reading...
module.website.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]
module.website.module.webserver_profile.aws_iam_role.profile: Refreshing state... [id=webserver20230818170808794200000001]
module.webserver_userdata.data.cloudinit_config.config: Reading...
module.webserver_userdata.data.cloudinit_config.config: Read complete after 0s [id=3987101430]
module.cdn.aws_cloudfront_distribution.repo: Refreshing state... [id=E2S8EXIANFSP8E]
module.website.module.webserver_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=webserver20230818170808794200000001-20230818170809342500000004]
module.website.module.webserver_profile.aws_iam_instance_profile.profile: Refreshing state... [id=webserver]
data.aws_key_pair.aleks: Read complete after 0s [id=key-01c98b9723b518061]
data.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]
module.website-vpc.aws_eip.nat_eip["10.0.4.0/24"]: Refreshing state... [id=eipalloc-03ad22a4199a2bfe5]
module.website-vpc.aws_eip.nat_eip["10.0.5.0/24"]: Refreshing state... [id=eipalloc-0beb080e46efeb93f]
data.aws_ami.ubuntu_22: Read complete after 1s [id=ami-0ffc0965a705413c8]
module.website.aws_launch_template.website: Refreshing state... [id=lt-042ea5dd55b0fff3b]
module.cdn.data.aws_route53_zone.ih_com: Read complete after 1s [id=Z07662251LH3YRF2ERM3G]
module.cdn.aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_cdn.infrahouse.com_A]
module.cdn.aws_route53_record.cert_validation["cdn.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__a71dbd0ecfc060d317944e3be1dbf59b.cdn.infrahouse.com._CNAME]
data.aws_route53_zone.infrahouse_com: Read complete after 1s [id=Z07662251LH3YRF2ERM3G]
module.website.data.aws_route53_zone.webserver_zone: Reading...
module.website-vpc.data.aws_vpc.management_vpc[0]: Read complete after 1s [id=vpc-08e19d859c26d18b2]
module.website-vpc.data.aws_route_tables.mgmt_route_tables[0]: Reading...
module.cdn.aws_acm_certificate_validation.repo: Refreshing state... [id=2023-08-21 23:33:58.663 +0000 UTC]
module.website-vpc.data.aws_route_tables.mgmt_route_tables[0]: Read complete after 0s [id=us-west-1]
module.website-vpc.aws_subnet.all["10.0.4.0/24"]: Refreshing state... [id=subnet-086ccf1b7842243d2]
module.website-vpc.aws_default_route_table.default: Refreshing state... [id=rtb-06b702bdb0cadd810]
module.website-vpc.aws_subnet.all["10.0.6.0/24"]: Refreshing state... [id=subnet-01306fa9e14f9c980]
module.website-vpc.aws_route_table.all["10.0.5.0/24"]: Refreshing state... [id=rtb-0fc65675e5ce07bbf]
module.website-vpc.aws_subnet.all["10.0.7.0/24"]: Refreshing state... [id=subnet-06f352185ffc3fcd3]
module.website-vpc.aws_subnet.all["10.0.5.0/24"]: Refreshing state... [id=subnet-05fa33164c768ab65]
module.website-vpc.aws_default_security_group.default: Refreshing state... [id=sg-089f1a85f05cbd32a]
module.website-vpc.aws_vpc_peering_connection.link_to_management[0]: Refreshing state... [id=pcx-0fd00008e9a890b35]
module.website-vpc.aws_internet_gateway.ig: Refreshing state... [id=igw-0feb8f579048fc443]
module.website-vpc.aws_route_table.all["10.0.4.0/24"]: Refreshing state... [id=rtb-02ae9fc349324835b]
module.website-vpc.aws_route_table.all["10.0.6.0/24"]: Refreshing state... [id=rtb-0decbbf0182384dff]
module.website-vpc.aws_route_table.all["10.0.7.0/24"]: Refreshing state... [id=rtb-0f0d4ab6650ed47a4]
module.website.data.aws_route53_zone.webserver_zone: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]
module.website.aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be]
module.website.data.aws_subnet.selected: Reading...
module.website-vpc.aws_nat_gateway.nat_gw["10.0.4.0/24"]: Refreshing state... [id=nat-0a1c16012747ef5e4]
module.website-vpc.aws_nat_gateway.nat_gw["10.0.5.0/24"]: Refreshing state... [id=nat-00ac19ae43562352f]
module.website.aws_alb.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/web20230818170821317100000008/03a64b8fc9f0f055]
module.website-vpc.aws_route.route_from_mgmt_to_me[1]: Refreshing state... [id=r-rtb-04a16e74d5b12a3383177957334]
module.website-vpc.aws_route.route_from_mgmt_to_me[2]: Refreshing state... [id=r-rtb-067c30e65dd4108e93177957334]
module.website-vpc.aws_route.route_from_mgmt_to_me[0]: Refreshing state... [id=r-rtb-0d73383afeb6ad1423177957334]
module.website.data.aws_subnet.selected: Read complete after 0s [id=subnet-086ccf1b7842243d2]
module.website-vpc.aws_route.default_main: Refreshing state... [id=r-rtb-06b702bdb0cadd8101080289494]
module.website.aws_alb_target_group.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2023081817082140120000000a/4bab1c874db740af]
module.website-vpc.aws_route.subnet_public["10.0.5.0/24"]: Refreshing state... [id=r-rtb-0fc65675e5ce07bbf1080289494]
module.website-vpc.aws_route.subnet_public["10.0.4.0/24"]: Refreshing state... [id=r-rtb-02ae9fc349324835b1080289494]
module.website-vpc.aws_route.route_from_me_to_mgmt["10.0.5.0/24"]: Refreshing state... [id=r-rtb-0fc65675e5ce07bbf653952448]
module.website-vpc.aws_route.route_from_me_to_mgmt["10.0.4.0/24"]: Refreshing state... [id=r-rtb-02ae9fc349324835b653952448]
module.website-vpc.aws_route.route_from_me_to_mgmt["10.0.6.0/24"]: Refreshing state... [id=r-rtb-0decbbf0182384dff653952448]
module.website-vpc.aws_route.route_from_me_to_mgmt["10.0.7.0/24"]: Refreshing state... [id=r-rtb-0f0d4ab6650ed47a4653952448]
module.website-vpc.aws_route_table_association.private_rt_assoc["10.0.6.0/24"]: Refreshing state... [id=rtbassoc-0c1a3e4c874333baf]
module.website-vpc.aws_route_table_association.private_rt_assoc["10.0.7.0/24"]: Refreshing state... [id=rtbassoc-0da0fea7d999fcf5f]
module.website-vpc.aws_route_table_association.private_rt_assoc["10.0.4.0/24"]: Refreshing state... [id=rtbassoc-04d711a4b92896be2]
module.website-vpc.aws_route_table_association.private_rt_assoc["10.0.5.0/24"]: Refreshing state... [id=rtbassoc-0716045ba5eb092f0]
module.website-vpc.aws_route.subnet_private["10.0.6.0/24"]: Refreshing state... [id=r-rtb-0decbbf0182384dff1080289494]
module.website-vpc.aws_route.subnet_private["10.0.7.0/24"]: Refreshing state... [id=r-rtb-0f0d4ab6650ed47a41080289494]
module.website.aws_alb_listener.redirect_to_ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/3d984bc9f1cc3a7d]
module.website.aws_lb_listener.ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/46afaa712ae9fb70]
module.website.aws_autoscaling_group.website: Refreshing state... [id=web20231125205239428700000003]
module.website.aws_autoscaling_policy.cpu_load: Refreshing state... [id=web20231125205239428700000003]
module.website.aws_route53_record.apex[0]: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.website.data.aws_network_interface.alb[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_network_interface" "alb" {
      + arn               = (known after apply)
      + association       = (known after apply)
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = (known after apply)
      + id                = (known after apply)
      + interface_type    = (known after apply)
      + ipv6_addresses    = (known after apply)
      + mac_address       = (known after apply)
      + outpost_arn       = (known after apply)
      + owner_id          = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = (known after apply)
      + requester_id      = (known after apply)
      + security_groups   = (known after apply)
      + subnet_id         = (known after apply)
      + tags              = (known after apply)
      + vpc_id            = (known after apply)

      + filter {
          + name   = "description"
          + values = [
              + "ELB app/web20230818170821317100000008/03a64b8fc9f0f055",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + "subnet-086ccf1b7842243d2",
            ]
        }
    }

  # module.website.data.aws_network_interface.alb[1] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_network_interface" "alb" {
      + arn               = (known after apply)
      + association       = (known after apply)
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = (known after apply)
      + id                = (known after apply)
      + interface_type    = (known after apply)
      + ipv6_addresses    = (known after apply)
      + mac_address       = (known after apply)
      + outpost_arn       = (known after apply)
      + owner_id          = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = (known after apply)
      + requester_id      = (known after apply)
      + security_groups   = (known after apply)
      + subnet_id         = (known after apply)
      + tags              = (known after apply)
      + vpc_id            = (known after apply)

      + filter {
          + name   = "description"
          + values = [
              + "ELB app/web20230818170821317100000008/03a64b8fc9f0f055",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + "subnet-05fa33164c768ab65",
            ]
        }
    }

  # module.website.aws_acm_certificate.website must be replaced
-/+ resource "aws_acm_certificate" "website" {
      ~ arn                       = "arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "infrahouse.com"
              - resource_record_name  = "_7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_16f6deabd52e76d4ef61e80ec436b5df.shzbfwcggp.acm-validations.aws."
            },
          - {
              - domain_name           = "www.infrahouse.com"
              - resource_record_name  = "_c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_a709458fbe45b7dc599cdc357f4d81b8.shzbfwcggp.acm-validations.aws."
            },
          + {
              + domain_name           = "infrahouse.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2024-09-15T23:59:59Z" -> (known after apply)
      ~ not_before                = "2023-08-18T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "www.infrahouse.com",
            # (1 unchanged element hidden)
        ]
      - tags                      = {} -> null
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (3 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.website.aws_acm_certificate_validation.website will be created
  + resource "aws_acm_certificate_validation" "website" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.website.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "web20231125205239428700000003"
        name                             = "web20231125205239428700000003"
        # (28 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-042ea5dd55b0fff3b"
            name    = "web20231125205151213200000001"
          ~ version = "1" -> (known after apply)
        }

        # (7 unchanged blocks hidden)
    }

  # module.website.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                      = "lt-042ea5dd55b0fff3b"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "web20231125205151213200000001"
        tags                    = {}
      ~ user_data               = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gLSAiaWgtcHVwcGV0IgogIC0gIi0tZW52aXJvbm1lbnQiCiAgLSAicHJvZHVjdGlvbiIKICAtICItLWVudmlyb25tZW50cGF0aCIKICAtICJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cyIKICAtICItLXJvb3QtZGlyZWN0b3J5IgogIC0gIi9vcHQvcHVwcGV0LWNvZGUiCiAgLSAiLS1oaWVyYS1jb25maWciCiAgLSAie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9oaWVyYS55YW1sIgogIC0gIi0tbW9kdWxlLXBhdGgiCiAgLSAie3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzIgogIC0gImFwcGx5Igoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogfC0KICAgIFtkZWZhdWx0XQogICAgcmVnaW9uPXVzLXdlc3QtMQogICJwYXRoIjogIi9yb290Ly5hd3MvY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjAwIgotICJjb250ZW50IjogfAogICAgInB1cHBldF9lbnZpcm9ubWVudCI6ICJwcm9kdWN0aW9uIgogICAgInB1cHBldF9yb2xlIjogIndlYnNlcnZlciIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvcHVwcGV0LnlhbWwiCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiAie1wiaWgtcHVwcGV0XCI6e1wiZGVidWdcIjpmYWxzZSxcImVudmlyb25tZW50cGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHNcIixcImhpZXJhLWNvbmZpZ1wiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9oaWVyYS55YW1sXCIsXCJtb2R1bGUtcGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzXCIsXCJyb290LWRpcmVjdG9yeVwiOlwiL29wdC9wdXBwZXQtY29kZVwifX0iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2loLXB1cHBldC5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgoNCi0tTUlNRUJPVU5EQVJZLS0NCg==" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgotICJpbmZyYWhvdXNlLXB1cHBldC1kYXRhIgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gLSAiaWgtcHVwcGV0IgogIC0gIi0tZW52aXJvbm1lbnQiCiAgLSAicHJvZHVjdGlvbiIKICAtICItLWVudmlyb25tZW50cGF0aCIKICAtICJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cyIKICAtICItLXJvb3QtZGlyZWN0b3J5IgogIC0gIi9vcHQvcHVwcGV0LWNvZGUiCiAgLSAiLS1oaWVyYS1jb25maWciCiAgLSAiL29wdC9pbmZyYWhvdXNlLXB1cHBldC1kYXRhL2Vudmlyb25tZW50cy9wcm9kdWN0aW9uL2hpZXJhLnlhbWwiCiAgLSAiLS1tb2R1bGUtcGF0aCIKICAtICJ7cm9vdF9kaXJlY3Rvcnl9L21vZHVsZXMiCiAgLSAiYXBwbHkiCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiB8LQogICAgW2RlZmF1bHRdCiAgICByZWdpb249dXMtd2VzdC0xCiAgInBhdGgiOiAiL3Jvb3QvLmF3cy9jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2MDAiCi0gImNvbnRlbnQiOiB8CiAgICAicHVwcGV0X2Vudmlyb25tZW50IjogInByb2R1Y3Rpb24iCiAgICAicHVwcGV0X3JvbGUiOiAid2Vic2VydmVyIgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9wdXBwZXQueWFtbCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7XCJpaC1wdXBwZXRcIjp7XCJkZWJ1Z1wiOmZhbHNlLFwiZW52aXJvbm1lbnRwYXRoXCI6XCJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50c1wiLFwiaGllcmEtY29uZmlnXCI6XCIvb3B0L2luZnJhaG91c2UtcHVwcGV0LWRhdGEvZW52aXJvbm1lbnRzL3Byb2R1Y3Rpb24vaGllcmEueWFtbFwiLFwibW9kdWxlLXBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vbW9kdWxlc1wiLFwicm9vdC1kaXJlY3RvcnlcIjpcIi9vcHQvcHVwcGV0LWNvZGVcIn19IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9paC1wdXBwZXQuanNvbiIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKDQotLU1JTUVCT1VOREFSWS0tDQo="
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.website.aws_lb_listener.ssl will be updated in-place
  ~ resource "aws_lb_listener" "ssl" {
      ~ certificate_arn   = "arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/46afaa712ae9fb70"
        tags              = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.website.aws_route53_record.apex[0] will be updated in-place
  ~ resource "aws_route53_record" "apex" {
        id                               = "Z07662251LH3YRF2ERM3G_infrahouse.com_A"
        name                             = "infrahouse.com"
      ~ records                          = [
          - "13.57.111.77",
          - "54.241.134.203",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.website.aws_route53_record.cert_validation["infrahouse.com"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z07662251LH3YRF2ERM3G"
    }

Plan: 3 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.webserver_permissions: Reading...%0Adata.aws_iam_policy_document.webserver_permissions: Read complete after 0s [id=2218315402]%0Amodule.cdn.aws_acm_certificate.cdn: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/a09201ea-e83d-43ab-8abd-75004b7d5aa5]%0Amodule.cdn.data.aws_route53_zone.ih_com: Reading...%0Adata.aws_key_pair.aleks: Reading...%0Amodule.website.module.webserver_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/webserver20230818170808801500000002]%0Adata.aws_ami.ubuntu_22: Reading...%0Amodule.website.data.aws_caller_identity.current: Reading...%0Adata.aws_availability_zones.uw1: Reading...%0Amodule.website-vpc.data.aws_vpc.management_vpc[0]: Reading...%0Amodule.website.module.webserver_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.website-vpc.aws_vpc.vpc: Refreshing state... [id=vpc-0ae798f941be45345]%0Amodule.cdn.aws_cloudfront_cache_policy.default: Refreshing state... [id=ea742fff-3eb3-4437-bfce-2ef431afcfcc]%0Amodule.website.module.webserver_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Amodule.webserver_userdata.data.aws_region.current: Reading...%0Amodule.webserver_userdata.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Adata.aws_route53_zone.infrahouse_com: Reading...%0Amodule.website.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.website.module.webserver_profile.aws_iam_role.profile: Refreshing state... [id=webserver20230818170808794200000001]%0Amodule.webserver_userdata.data.cloudinit_config.config: Reading...%0Amodule.webserver_userdata.data.cloudinit_config.config: Read complete after 0s [id=3987101430]%0Amodule.cdn.aws_cloudfront_distribution.repo: Refreshing state... [id=E2S8EXIANFSP8E]%0Amodule.website.module.webserver_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=webserver20230818170808794200000001-20230818170809342500000004]%0Amodule.website.module.webserver_profile.aws_iam_instance_profile.profile: Refreshing state... [id=webserver]%0Adata.aws_key_pair.aleks: Read complete after 0s [id=key-01c98b9723b518061]%0Adata.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]%0Amodule.website-vpc.aws_eip.nat_eip["10.0.4.0/24"]: Refreshing state... [id=eipalloc-03ad22a4199a2bfe5]%0Amodule.website-vpc.aws_eip.nat_eip["10.0.5.0/24"]: Refreshing state... [id=eipalloc-0beb080e46efeb93f]%0Adata.aws_ami.ubuntu_22: Read complete after 1s [id=ami-0ffc0965a705413c8]%0Amodule.website.aws_launch_template.website: Refreshing state... [id=lt-042ea5dd55b0fff3b]%0Amodule.cdn.data.aws_route53_zone.ih_com: Read complete after 1s [id=Z07662251LH3YRF2ERM3G]%0Amodule.cdn.aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_cdn.infrahouse.com_A]%0Amodule.cdn.aws_route53_record.cert_validation["cdn.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__a71dbd0ecfc060d317944e3be1dbf59b.cdn.infrahouse.com._CNAME]%0Adata.aws_route53_zone.infrahouse_com: Read complete after 1s [id=Z07662251LH3YRF2ERM3G]%0Amodule.website.data.aws_route53_zone.webserver_zone: Reading...%0Amodule.website-vpc.data.aws_vpc.management_vpc[0]: Read complete after 1s [id=vpc-08e19d859c26d18b2]%0Amodule.website-vpc.data.aws_route_tables.mgmt_route_tables[0]: Reading...%0Amodule.cdn.aws_acm_certificate_validation.repo: Refreshing state... [id=2023-08-21 23:33:58.663 +0000 UTC]%0Amodule.website-vpc.data.aws_route_tables.mgmt_route_tables[0]: Read complete after 0s [id=us-west-1]%0Amodule.website-vpc.aws_subnet.all["10.0.4.0/24"]: Refreshing state... [id=subnet-086ccf1b7842243d2]%0Amodule.website-vpc.aws_default_route_table.default: Refreshing state... [id=rtb-06b702bdb0cadd810]%0Amodule.website-vpc.aws_subnet.all["10.0.6.0/24"]: Refreshing state... [id=subnet-01306fa9e14f9c980]%0Amodule.website-vpc.aws_route_table.all["10.0.5.0/24"]: Refreshing state... [id=rtb-0fc65675e5ce07bbf]%0Amodule.website-vpc.aws_subnet.all["10.0.7.0/24"]: Refreshing state... [id=subnet-06f352185ffc3fcd3]%0Amodule.website-vpc.aws_subnet.all["10.0.5.0/24"]: Refreshing state... [id=subnet-05fa33164c768ab65]%0Amodule.website-vpc.aws_default_security_group.default: Refreshing state... [id=sg-089f1a85f05cbd32a]%0Amodule.website-vpc.aws_vpc_peering_connection.link_to_management[0]: Refreshing state... [id=pcx-0fd00008e9a890b35]%0Amodule.website-vpc.aws_internet_gateway.ig: Refreshing state... [id=igw-0feb8f579048fc443]%0Amodule.website-vpc.aws_route_table.all["10.0.4.0/24"]: Refreshing state... [id=rtb-02ae9fc349324835b]%0Amodule.website-vpc.aws_route_table.all["10.0.6.0/24"]: Refreshing state... [id=rtb-0decbbf0182384dff]%0Amodule.website-vpc.aws_route_table.all["10.0.7.0/24"]: Refreshing state... [id=rtb-0f0d4ab6650ed47a4]%0Amodule.website.data.aws_route53_zone.webserver_zone: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Amodule.website.aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be]%0Amodule.website.data.aws_subnet.selected: Reading...%0Amodule.website-vpc.aws_nat_gateway.nat_gw["10.0.4.0/24"]: Refreshing state... [id=nat-0a1c16012747ef5e4]%0Amodule.website-vpc.aws_nat_gateway.nat_gw["10.0.5.0/24"]: Refreshing state... [id=nat-00ac19ae43562352f]%0Amodule.website.aws_alb.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/web20230818170821317100000008/03a64b8fc9f0f055]%0Amodule.website-vpc.aws_route.route_from_mgmt_to_me[1]: Refreshing state... [id=r-rtb-04a16e74d5b12a3383177957334]%0Amodule.website-vpc.aws_route.route_from_mgmt_to_me[2]: Refreshing state... [id=r-rtb-067c30e65dd4108e93177957334]%0Amodule.website-vpc.aws_route.route_from_mgmt_to_me[0]: Refreshing state... [id=r-rtb-0d73383afeb6ad1423177957334]%0Amodule.website.data.aws_subnet.selected: Read complete after 0s [id=subnet-086ccf1b7842243d2]%0Amodule.website-vpc.aws_route.default_main: Refreshing state... [id=r-rtb-06b702bdb0cadd8101080289494]%0Amodule.website.aws_alb_target_group.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2023081817082140120000000a/4bab1c874db740af]%0Amodule.website-vpc.aws_route.subnet_public["10.0.5.0/24"]: Refreshing state... [id=r-rtb-0fc65675e5ce07bbf1080289494]%0Amodule.website-vpc.aws_route.subnet_public["10.0.4.0/24"]: Refreshing state... [id=r-rtb-02ae9fc349324835b1080289494]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.5.0/24"]: Refreshing state... [id=r-rtb-0fc65675e5ce07bbf653952448]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.4.0/24"]: Refreshing state... [id=r-rtb-02ae9fc349324835b653952448]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.6.0/24"]: Refreshing state... [id=r-rtb-0decbbf0182384dff653952448]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.7.0/24"]: Refreshing state... [id=r-rtb-0f0d4ab6650ed47a4653952448]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.6.0/24"]: Refreshing state... [id=rtbassoc-0c1a3e4c874333baf]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.7.0/24"]: Refreshing state... [id=rtbassoc-0da0fea7d999fcf5f]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.4.0/24"]: Refreshing state... [id=rtbassoc-04d711a4b92896be2]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.5.0/24"]: Refreshing state... [id=rtbassoc-0716045ba5eb092f0]%0Amodule.website-vpc.aws_route.subnet_private["10.0.6.0/24"]: Refreshing state... [id=r-rtb-0decbbf0182384dff1080289494]%0Amodule.website-vpc.aws_route.subnet_private["10.0.7.0/24"]: Refreshing state... [id=r-rtb-0f0d4ab6650ed47a41080289494]%0Amodule.website.aws_alb_listener.redirect_to_ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/3d984bc9f1cc3a7d]%0Amodule.website.aws_lb_listener.ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/46afaa712ae9fb70]%0Amodule.website.aws_autoscaling_group.website: Refreshing state... [id=web20231125205239428700000003]%0Amodule.website.aws_autoscaling_policy.cpu_load: Refreshing state... [id=web20231125205239428700000003]%0Amodule.website.aws_route53_record.apex[0]: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_A]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.website.data.aws_network_interface.alb[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_network_interface" "alb" {%0A      + arn               = (known after apply)%0A      + association       = (known after apply)%0A      + attachment        = (known after apply)%0A      + availability_zone = (known after apply)%0A      + description       = (known after apply)%0A      + id                = (known after apply)%0A      + interface_type    = (known after apply)%0A      + ipv6_addresses    = (known after apply)%0A      + mac_address       = (known after apply)%0A      + outpost_arn       = (known after apply)%0A      + owner_id          = (known after apply)%0A      + private_dns_name  = (known after apply)%0A      + private_ip        = (known after apply)%0A      + private_ips       = (known after apply)%0A      + requester_id      = (known after apply)%0A      + security_groups   = (known after apply)%0A      + subnet_id         = (known after apply)%0A      + tags              = (known after apply)%0A      + vpc_id            = (known after apply)%0A%0A      + filter {%0A          + name   = "description"%0A          + values = [%0A              + "ELB app/web20230818170821317100000008/03a64b8fc9f0f055",%0A            ]%0A        }%0A      + filter {%0A          + name   = "subnet-id"%0A          + values = [%0A              + "subnet-086ccf1b7842243d2",%0A            ]%0A        }%0A    }%0A%0A  # module.website.data.aws_network_interface.alb[1] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_network_interface" "alb" {%0A      + arn               = (known after apply)%0A      + association       = (known after apply)%0A      + attachment        = (known after apply)%0A      + availability_zone = (known after apply)%0A      + description       = (known after apply)%0A      + id                = (known after apply)%0A      + interface_type    = (known after apply)%0A      + ipv6_addresses    = (known after apply)%0A      + mac_address       = (known after apply)%0A      + outpost_arn       = (known after apply)%0A      + owner_id          = (known after apply)%0A      + private_dns_name  = (known after apply)%0A      + private_ip        = (known after apply)%0A      + private_ips       = (known after apply)%0A      + requester_id      = (known after apply)%0A      + security_groups   = (known after apply)%0A      + subnet_id         = (known after apply)%0A      + tags              = (known after apply)%0A      + vpc_id            = (known after apply)%0A%0A      + filter {%0A          + name   = "description"%0A          + values = [%0A              + "ELB app/web20230818170821317100000008/03a64b8fc9f0f055",%0A            ]%0A        }%0A      + filter {%0A          + name   = "subnet-id"%0A          + values = [%0A              + "subnet-05fa33164c768ab65",%0A            ]%0A        }%0A    }%0A%0A  # module.website.aws_acm_certificate.website must be replaced%0A-/+ resource "aws_acm_certificate" "website" {%0A      ~ arn                       = "arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be" -> (known after apply)%0A      ~ domain_validation_options = [%0A          - {%0A              - domain_name           = "infrahouse.com"%0A              - resource_record_name  = "_7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com."%0A              - resource_record_type  = "CNAME"%0A              - resource_record_value = "_16f6deabd52e76d4ef61e80ec436b5df.shzbfwcggp.acm-validations.aws."%0A            },%0A          - {%0A              - domain_name           = "www.infrahouse.com"%0A              - resource_record_name  = "_c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com."%0A              - resource_record_type  = "CNAME"%0A              - resource_record_value = "_a709458fbe45b7dc599cdc357f4d81b8.shzbfwcggp.acm-validations.aws."%0A            },%0A          + {%0A              + domain_name           = "infrahouse.com"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A        ]%0A      ~ id                        = "arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be" -> (known after apply)%0A      ~ key_algorithm             = "RSA_2048" -> (known after apply)%0A      ~ not_after                 = "2024-09-15T23:59:59Z" -> (known after apply)%0A      ~ not_before                = "2023-08-18T00:00:00Z" -> (known after apply)%0A      ~ pending_renewal           = false -> (known after apply)%0A      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)%0A      ~ renewal_summary           = [] -> (known after apply)%0A      ~ status                    = "ISSUED" -> (known after apply)%0A      ~ subject_alternative_names = [ # forces replacement%0A          - "www.infrahouse.com",%0A            # (1 unchanged element hidden)%0A        ]%0A      - tags                      = {} -> null%0A      ~ type                      = "AMAZON_ISSUED" -> (known after apply)%0A      ~ validation_emails         = [] -> (known after apply)%0A        # (3 unchanged attributes hidden)%0A%0A      - options {%0A          - certificate_transparency_logging_preference = "ENABLED" -> null%0A        }%0A    }%0A%0A  # module.website.aws_acm_certificate_validation.website will be created%0A  + resource "aws_acm_certificate_validation" "website" {%0A      + certificate_arn         = (known after apply)%0A      + id                      = (known after apply)%0A      + validation_record_fqdns = (known after apply)%0A    }%0A%0A  # module.website.aws_autoscaling_group.website will be updated in-place%0A  ~ resource "aws_autoscaling_group" "website" {%0A        id                               = "web20231125205239428700000003"%0A        name                             = "web20231125205239428700000003"%0A        # (28 unchanged attributes hidden)%0A%0A      ~ launch_template {%0A            id      = "lt-042ea5dd55b0fff3b"%0A            name    = "web20231125205151213200000001"%0A          ~ version = "1" -> (known after apply)%0A        }%0A%0A        # (7 unchanged blocks hidden)%0A    }%0A%0A  # module.website.aws_launch_template.website will be updated in-place%0A  ~ resource "aws_launch_template" "website" {%0A        id                      = "lt-042ea5dd55b0fff3b"%0A      ~ latest_version          = 1 -> (known after apply)%0A        name                    = "web20231125205151213200000001"%0A        tags                    = {}%0A      ~ user_data               = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gLSAiaWgtcHVwcGV0IgogIC0gIi0tZW52aXJvbm1lbnQiCiAgLSAicHJvZHVjdGlvbiIKICAtICItLWVudmlyb25tZW50cGF0aCIKICAtICJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cyIKICAtICItLXJvb3QtZGlyZWN0b3J5IgogIC0gIi9vcHQvcHVwcGV0LWNvZGUiCiAgLSAiLS1oaWVyYS1jb25maWciCiAgLSAie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9oaWVyYS55YW1sIgogIC0gIi0tbW9kdWxlLXBhdGgiCiAgLSAie3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzIgogIC0gImFwcGx5Igoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogfC0KICAgIFtkZWZhdWx0XQogICAgcmVnaW9uPXVzLXdlc3QtMQogICJwYXRoIjogIi9yb290Ly5hd3MvY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjAwIgotICJjb250ZW50IjogfAogICAgInB1cHBldF9lbnZpcm9ubWVudCI6ICJwcm9kdWN0aW9uIgogICAgInB1cHBldF9yb2xlIjogIndlYnNlcnZlciIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvcHVwcGV0LnlhbWwiCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiAie1wiaWgtcHVwcGV0XCI6e1wiZGVidWdcIjpmYWxzZSxcImVudmlyb25tZW50cGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHNcIixcImhpZXJhLWNvbmZpZ1wiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9oaWVyYS55YW1sXCIsXCJtb2R1bGUtcGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzXCIsXCJyb290LWRpcmVjdG9yeVwiOlwiL29wdC9wdXBwZXQtY29kZVwifX0iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2loLXB1cHBldC5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgoNCi0tTUlNRUJPVU5EQVJZLS0NCg==" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgotICJpbmZyYWhvdXNlLXB1cHBldC1kYXRhIgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gLSAiaWgtcHVwcGV0IgogIC0gIi0tZW52aXJvbm1lbnQiCiAgLSAicHJvZHVjdGlvbiIKICAtICItLWVudmlyb25tZW50cGF0aCIKICAtICJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cyIKICAtICItLXJvb3QtZGlyZWN0b3J5IgogIC0gIi9vcHQvcHVwcGV0LWNvZGUiCiAgLSAiLS1oaWVyYS1jb25maWciCiAgLSAiL29wdC9pbmZyYWhvdXNlLXB1cHBldC1kYXRhL2Vudmlyb25tZW50cy9wcm9kdWN0aW9uL2hpZXJhLnlhbWwiCiAgLSAiLS1tb2R1bGUtcGF0aCIKICAtICJ7cm9vdF9kaXJlY3Rvcnl9L21vZHVsZXMiCiAgLSAiYXBwbHkiCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiB8LQogICAgW2RlZmF1bHRdCiAgICByZWdpb249dXMtd2VzdC0xCiAgInBhdGgiOiAiL3Jvb3QvLmF3cy9jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2MDAiCi0gImNvbnRlbnQiOiB8CiAgICAicHVwcGV0X2Vudmlyb25tZW50IjogInByb2R1Y3Rpb24iCiAgICAicHVwcGV0X3JvbGUiOiAid2Vic2VydmVyIgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9wdXBwZXQueWFtbCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7XCJpaC1wdXBwZXRcIjp7XCJkZWJ1Z1wiOmZhbHNlLFwiZW52aXJvbm1lbnRwYXRoXCI6XCJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50c1wiLFwiaGllcmEtY29uZmlnXCI6XCIvb3B0L2luZnJhaG91c2UtcHVwcGV0LWRhdGEvZW52aXJvbm1lbnRzL3Byb2R1Y3Rpb24vaGllcmEueWFtbFwiLFwibW9kdWxlLXBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vbW9kdWxlc1wiLFwicm9vdC1kaXJlY3RvcnlcIjpcIi9vcHQvcHVwcGV0LWNvZGVcIn19IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9paC1wdXBwZXQuanNvbiIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKDQotLU1JTUVCT1VOREFSWS0tDQo="%0A        # (11 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.website.aws_lb_listener.ssl will be updated in-place%0A  ~ resource "aws_lb_listener" "ssl" {%0A      ~ certificate_arn   = "arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be" -> (known after apply)%0A        id                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/46afaa712ae9fb70"%0A        tags              = {}%0A        # (6 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.website.aws_route53_record.apex[0] will be updated in-place%0A  ~ resource "aws_route53_record" "apex" {%0A        id                               = "Z07662251LH3YRF2ERM3G_infrahouse.com_A"%0A        name                             = "infrahouse.com"%0A      ~ records                          = [%0A          - "13.57.111.77",%0A          - "54.241.134.203",%0A        ] -> (known after apply)%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.website.aws_route53_record.cert_validation["infrahouse.com"] will be created%0A  + resource "aws_route53_record" "cert_validation" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = (known after apply)%0A      + records         = (known after apply)%0A      + ttl             = 60%0A      + type            = (known after apply)%0A      + zone_id         = "Z07662251LH3YRF2ERM3G"%0A    }%0A%0APlan: 3 to add, 4 to change, 1 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS90ZXJyYWZvcm0udGZzdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvZGI3Y2MyZTYtMjUxMS00YTZkLWFmNzctMjA5N2ZiN2Q3MGQyL3RlcnJhZm9ybS1iaW4gcGxhbiAtbm8tY29sb3IgLS1vdXQ9dGYucGxhblxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC53ZWJzZXJ2ZXJfcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2VydmVyX3Blcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjE4MzE1NDAyXVxubW9kdWxlLmNkbi5hd3NfYWNtX2NlcnRpZmljYXRlLmNkbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czphY206dXMtZWFzdC0xOjQ5MzM3MDgyNjQyNDpjZXJ0aWZpY2F0ZS9hMDkyMDFlYS1lODNkLTQzYWItOGFiZC03NTAwNGI3ZDVhYTVdXG5tb2R1bGUuY2RuLmRhdGEuYXdzX3JvdXRlNTNfem9uZS5paF9jb206IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2tleV9wYWlyLmFsZWtzOiBSZWFkaW5nLi4uXG5tb2R1bGUud2Vic2l0ZS5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9wb2xpY3kucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvd2Vic2VydmVyMjAyMzA4MTgxNzA4MDg4MDE1MDAwMDAwMDJdXG5kYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkaW5nLi4uXG5tb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLlxuZGF0YS5hd3NfYXZhaWxhYmlsaXR5X3pvbmVzLnV3MTogUmVhZGluZy4uLlxubW9kdWxlLndlYnNpdGUtdnBjLmRhdGEuYXdzX3ZwYy5tYW5hZ2VtZW50X3ZwY1swXTogUmVhZGluZy4uLlxubW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3ZwYy52cGM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXZwYy0wYWU3OThmOTQxYmU0NTM0NV1cbm1vZHVsZS5jZG4uYXdzX2Nsb3VkZnJvbnRfY2FjaGVfcG9saWN5LmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVhNzQyZmZmLTNlYjMtNDQzNy1iZmNlLTJlZjQzMWFmY2ZjY11cbm1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg1MTExOTQyN11cbm1vZHVsZS53ZWJzZXJ2ZXJfdXNlcmRhdGEuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWRpbmcuLi5cbm1vZHVsZS53ZWJzZXJ2ZXJfdXNlcmRhdGEuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV1cbmRhdGEuYXdzX3JvdXRlNTNfem9uZS5pbmZyYWhvdXNlX2NvbTogUmVhZGluZy4uLlxubW9kdWxlLndlYnNpdGUuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQ5MzM3MDgyNjQyNF1cbm1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX3JvbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2VydmVyMjAyMzA4MTgxNzA4MDg3OTQyMDAwMDAwMDFdXG5tb2R1bGUud2Vic2VydmVyX3VzZXJkYXRhLmRhdGEuY2xvdWRpbml0X2NvbmZpZy5jb25maWc6IFJlYWRpbmcuLi5cbm1vZHVsZS53ZWJzZXJ2ZXJfdXNlcmRhdGEuZGF0YS5jbG91ZGluaXRfY29uZmlnLmNvbmZpZzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mzk4NzEwMTQzMF1cbm1vZHVsZS5jZG4uYXdzX2Nsb3VkZnJvbnRfZGlzdHJpYnV0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUUyUzhFWElBTkZTUDhFXVxubW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzZXJ2ZXIyMDIzMDgxODE3MDgwODc5NDIwMDAwMDAwMS0yMDIzMDgxODE3MDgwOTM0MjUwMDAwMDAwNF1cbm1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX2luc3RhbmNlX3Byb2ZpbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2VydmVyXVxuZGF0YS5hd3Nfa2V5X3BhaXIuYWxla3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWtleS0wMWM5OGI5NzIzYjUxODA2MV1cbmRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfZWlwLm5hdF9laXBbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWlwYWxsb2MtMDNhZDIyYTQxOTlhMmJmZTVdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVpcGFsbG9jLTBiZWIwODBlNDZlZmViOTNmXVxuZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YW1pLTBmZmMwOTY1YTcwNTQxM2M4XVxubW9kdWxlLndlYnNpdGUuYXdzX2xhdW5jaF90ZW1wbGF0ZS53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sdC0wNDJlYTVkZDU1YjBmZmYzYl1cbm1vZHVsZS5jZG4uZGF0YS5hd3Nfcm91dGU1M196b25lLmloX2NvbTogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXVxubW9kdWxlLmNkbi5hd3Nfcm91dGU1M19yZWNvcmQucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2Nkbi5pbmZyYWhvdXNlLmNvbV9BXVxubW9kdWxlLmNkbi5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wiY2RuLmluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfX2E3MWRiZDBlY2ZjMDYwZDMxNzk0NGUzYmUxZGJmNTliLmNkbi5pbmZyYWhvdXNlLmNvbS5fQ05BTUVdXG5kYXRhLmF3c19yb3V0ZTUzX3pvbmUuaW5mcmFob3VzZV9jb206IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR11cbm1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX3JvdXRlNTNfem9uZS53ZWJzZXJ2ZXJfem9uZTogUmVhZGluZy4uLlxubW9kdWxlLndlYnNpdGUtdnBjLmRhdGEuYXdzX3ZwYy5tYW5hZ2VtZW50X3ZwY1swXTogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9dnBjLTA4ZTE5ZDg1OWMyNmQxOGIyXVxubW9kdWxlLndlYnNpdGUtdnBjLmRhdGEuYXdzX3JvdXRlX3RhYmxlcy5tZ210X3JvdXRlX3RhYmxlc1swXTogUmVhZGluZy4uLlxubW9kdWxlLmNkbi5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MjAyMy0wOC0yMSAyMzozMzo1OC42NjMgKzAwMDAgVVRDXVxubW9kdWxlLndlYnNpdGUtdnBjLmRhdGEuYXdzX3JvdXRlX3RhYmxlcy5tZ210X3JvdXRlX3RhYmxlc1swXTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19zdWJuZXQuYWxsW1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wODZjY2YxYjc4NDIyNDNkMl1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfZGVmYXVsdF9yb3V0ZV90YWJsZS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDZiNzAyYmRiMGNhZGQ4MTBdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjYuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTAxMzA2ZmE5ZTE0ZjljOTgwXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBmYzY1Njc1ZTVjZTA3YmJmXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19zdWJuZXQuYWxsW1wiMTAuMC43LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wNmYzNTIxODVmZmMzZmNkM11cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDVmYTMzMTY0Yzc2OGFiNjVdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX2RlZmF1bHRfc2VjdXJpdHlfZ3JvdXAuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDg5ZjFhODVmMDVjYmQzMmFdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3ZwY19wZWVyaW5nX2Nvbm5lY3Rpb24ubGlua190b19tYW5hZ2VtZW50WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wY3gtMGZkMDAwMDhlOWE4OTBiMzVdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX2ludGVybmV0X2dhdGV3YXkuaWc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlndy0wZmViOGY1NzkwNDhmYzQ0M11cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wMmFlOWZjMzQ5MzI0ODM1Yl1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC42LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wZGVjYmJmMDE4MjM4NGRmZl1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC43LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wZjBkNGFiNjY1MGVkNDdhNF1cbm1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX3JvdXRlNTNfem9uZS53ZWJzZXJ2ZXJfem9uZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXVxubW9kdWxlLndlYnNpdGUuYXdzX2FjbV9jZXJ0aWZpY2F0ZS53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmFjbTp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlLzdmNTAxYTNlLWU5M2EtNGQ5Ny05OWUzLWM2YmY1NzNjNTliZV1cbm1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX3N1Ym5ldC5zZWxlY3RlZDogUmVhZGluZy4uLlxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTBhMWMxNjAxMjc0N2VmNWU0XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTAwYWMxOWFlNDM1NjIzNTJmXVxubW9kdWxlLndlYnNpdGUuYXdzX2FsYi53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bG9hZGJhbGFuY2VyL2FwcC93ZWIyMDIzMDgxODE3MDgyMTMxNzEwMDAwMDAwOC8wM2E2NGI4ZmM5ZjBmMDU1XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21nbXRfdG9fbWVbMV06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA0YTE2ZTc0ZDViMTJhMzM4MzE3Nzk1NzMzNF1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUucm91dGVfZnJvbV9tZ210X3RvX21lWzJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNjdjMzBlNjVkZDQxMDhlOTMxNzc5NTczMzRdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWdtdF90b19tZVswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGQ3MzM4M2FmZWI2YWQxNDIzMTc3OTU3MzM0XVxubW9kdWxlLndlYnNpdGUuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1zdWJuZXQtMDg2Y2NmMWI3ODQyMjQzZDJdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLmRlZmF1bHRfbWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDZiNzAyYmRiMGNhZGQ4MTAxMDgwMjg5NDk0XVxubW9kdWxlLndlYnNpdGUuYXdzX2FsYl90YXJnZXRfZ3JvdXAud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhcmdldGdyb3VwL3RmLTIwMjMwODE4MTcwODIxNDAxMjAwMDAwMDBhLzRiYWIxYzg3NGRiNzQwYWZdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnN1Ym5ldF9wdWJsaWNbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGZjNjU2NzVlNWNlMDdiYmYxMDgwMjg5NDk0XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5zdWJuZXRfcHVibGljW1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTAyYWU5ZmMzNDkzMjQ4MzViMTA4MDI4OTQ5NF1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUucm91dGVfZnJvbV9tZV90b19tZ210W1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBmYzY1Njc1ZTVjZTA3YmJmNjUzOTUyNDQ4XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21lX3RvX21nbXRbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDJhZTlmYzM0OTMyNDgzNWI2NTM5NTI0NDhdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZGVjYmJmMDE4MjM4NGRmZjY1Mzk1MjQ0OF1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUucm91dGVfZnJvbV9tZV90b19tZ210W1wiMTAuMC43LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBmMGQ0YWI2NjUwZWQ0N2E0NjUzOTUyNDQ4XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC42LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTBjMWEzZTRjODc0MzMzYmFmXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC43LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTBkYTBmZWE3ZDk5OWZjZjVmXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTA0ZDcxMWE0YjkyODk2YmUyXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTA3MTYwNDViYTVlYjA5MmYwXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZGVjYmJmMDE4MjM4NGRmZjEwODAyODk0OTRdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC43LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBmMGQ0YWI2NjUwZWQ0N2E0MTA4MDI4OTQ5NF1cbm1vZHVsZS53ZWJzaXRlLmF3c19hbGJfbGlzdGVuZXIucmVkaXJlY3RfdG9fc3NsOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bGlzdGVuZXIvYXBwL3dlYjIwMjMwODE4MTcwODIxMzE3MTAwMDAwMDA4LzAzYTY0YjhmYzlmMGYwNTUvM2Q5ODRiYzlmMWNjM2E3ZF1cbm1vZHVsZS53ZWJzaXRlLmF3c19sYl9saXN0ZW5lci5zc2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsaXN0ZW5lci9hcHAvd2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgvMDNhNjRiOGZjOWYwZjA1NS80NmFmYWE3MTJhZTlmYjcwXVxubW9kdWxlLndlYnNpdGUuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYjIwMjMxMTI1MjA1MjM5NDI4NzAwMDAwMDAzXVxubW9kdWxlLndlYnNpdGUuYXdzX2F1dG9zY2FsaW5nX3BvbGljeS5jcHVfbG9hZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2ViMjAyMzExMjUyMDUyMzk0Mjg3MDAwMDAwMDNdXG5tb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQuYXBleFswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX0FdXG5cblRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgKyBjcmVhdGVcbiAgfiB1cGRhdGUgaW4tcGxhY2Vcbi0vKyBkZXN0cm95IGFuZCB0aGVuIGNyZWF0ZSByZXBsYWNlbWVudFxuIDw9IHJlYWQgKGRhdGEgcmVzb3VyY2VzKVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuICAjIG1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX25ldHdvcmtfaW50ZXJmYWNlLmFsYlswXSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZylcbiA8PSBkYXRhIFwiYXdzX25ldHdvcmtfaW50ZXJmYWNlXCIgXCJhbGJcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhc3NvY2lhdGlvbiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXR0YWNobWVudCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGF2YWlsYWJpbGl0eV96b25lID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGludGVyZmFjZV90eXBlICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpcHY2X2FkZHJlc3NlcyAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWFjX2FkZHJlc3MgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHBvc3RfYXJuICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvd25lcl9pZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpdmF0ZV9kbnNfbmFtZSAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHByaXZhdGVfaXAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcml2YXRlX2lwcyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmVxdWVzdGVyX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNlY3VyaXR5X2dyb3VwcyAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdWJuZXRfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHZwY19pZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuXG4gICAgICArIGZpbHRlciB7XG4gICAgICAgICAgKyBuYW1lICAgPSBcImRlc2NyaXB0aW9uXCJcbiAgICAgICAgICArIHZhbHVlcyA9IFtcbiAgICAgICAgICAgICAgKyBcIkVMQiBhcHAvd2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgvMDNhNjRiOGZjOWYwZjA1NVwiLFxuICAgICAgICAgICAgXVxuICAgICAgICB9XG4gICAgICArIGZpbHRlciB7XG4gICAgICAgICAgKyBuYW1lICAgPSBcInN1Ym5ldC1pZFwiXG4gICAgICAgICAgKyB2YWx1ZXMgPSBbXG4gICAgICAgICAgICAgICsgXCJzdWJuZXQtMDg2Y2NmMWI3ODQyMjQzZDJcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX25ldHdvcmtfaW50ZXJmYWNlLmFsYlsxXSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZylcbiA8PSBkYXRhIFwiYXdzX25ldHdvcmtfaW50ZXJmYWNlXCIgXCJhbGJcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhc3NvY2lhdGlvbiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXR0YWNobWVudCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGF2YWlsYWJpbGl0eV96b25lID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGludGVyZmFjZV90eXBlICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpcHY2X2FkZHJlc3NlcyAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWFjX2FkZHJlc3MgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHBvc3RfYXJuICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvd25lcl9pZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpdmF0ZV9kbnNfbmFtZSAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHByaXZhdGVfaXAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcml2YXRlX2lwcyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmVxdWVzdGVyX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNlY3VyaXR5X2dyb3VwcyAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdWJuZXRfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHZwY19pZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuXG4gICAgICArIGZpbHRlciB7XG4gICAgICAgICAgKyBuYW1lICAgPSBcImRlc2NyaXB0aW9uXCJcbiAgICAgICAgICArIHZhbHVlcyA9IFtcbiAgICAgICAgICAgICAgKyBcIkVMQiBhcHAvd2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgvMDNhNjRiOGZjOWYwZjA1NVwiLFxuICAgICAgICAgICAgXVxuICAgICAgICB9XG4gICAgICArIGZpbHRlciB7XG4gICAgICAgICAgKyBuYW1lICAgPSBcInN1Ym5ldC1pZFwiXG4gICAgICAgICAgKyB2YWx1ZXMgPSBbXG4gICAgICAgICAgICAgICsgXCJzdWJuZXQtMDVmYTMzMTY0Yzc2OGFiNjVcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS53ZWJzaXRlLmF3c19hY21fY2VydGlmaWNhdGUud2Vic2l0ZSBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJhd3NfYWNtX2NlcnRpZmljYXRlXCIgXCJ3ZWJzaXRlXCIge1xuICAgICAgfiBhcm4gICAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmFjbTp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlLzdmNTAxYTNlLWU5M2EtNGQ5Ny05OWUzLWM2YmY1NzNjNTliZVwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gZG9tYWluX3ZhbGlkYXRpb25fb3B0aW9ucyA9IFtcbiAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgLSBkb21haW5fbmFtZSAgICAgICAgICAgPSBcImluZnJhaG91c2UuY29tXCJcbiAgICAgICAgICAgICAgLSByZXNvdXJjZV9yZWNvcmRfbmFtZSAgPSBcIl83NTA0YzVjN2JkYzQ5YTZiZGNhZDUwZmM3ZDZiNDY5Ny5pbmZyYWhvdXNlLmNvbS5cIlxuICAgICAgICAgICAgICAtIHJlc291cmNlX3JlY29yZF90eXBlICA9IFwiQ05BTUVcIlxuICAgICAgICAgICAgICAtIHJlc291cmNlX3JlY29yZF92YWx1ZSA9IFwiXzE2ZjZkZWFiZDUyZTc2ZDRlZjYxZTgwZWM0MzZiNWRmLnNoemJmd2NnZ3AuYWNtLXZhbGlkYXRpb25zLmF3cy5cIlxuICAgICAgICAgICAgfSxcbiAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgLSBkb21haW5fbmFtZSAgICAgICAgICAgPSBcInd3dy5pbmZyYWhvdXNlLmNvbVwiXG4gICAgICAgICAgICAgIC0gcmVzb3VyY2VfcmVjb3JkX25hbWUgID0gXCJfYzkwNTU2YmRmMmE3Zjc4OTQwMWYxZWMwNWEwY2I1NjAud3d3LmluZnJhaG91c2UuY29tLlwiXG4gICAgICAgICAgICAgIC0gcmVzb3VyY2VfcmVjb3JkX3R5cGUgID0gXCJDTkFNRVwiXG4gICAgICAgICAgICAgIC0gcmVzb3VyY2VfcmVjb3JkX3ZhbHVlID0gXCJfYTcwOTQ1OGZiZTQ1YjdkYzU5OWNkYzM1N2Y0ZDgxYjguc2h6YmZ3Y2dncC5hY20tdmFsaWRhdGlvbnMuYXdzLlwiXG4gICAgICAgICAgICB9LFxuICAgICAgICAgICsge1xuICAgICAgICAgICAgICArIGRvbWFpbl9uYW1lICAgICAgICAgICA9IFwiaW5mcmFob3VzZS5jb21cIlxuICAgICAgICAgICAgICArIHJlc291cmNlX3JlY29yZF9uYW1lICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgICAgKyByZXNvdXJjZV9yZWNvcmRfdHlwZSAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICAgICsgcmVzb3VyY2VfcmVjb3JkX3ZhbHVlID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfSxcbiAgICAgICAgXVxuICAgICAgfiBpZCAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmFjbTp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlLzdmNTAxYTNlLWU5M2EtNGQ5Ny05OWUzLWM2YmY1NzNjNTliZVwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4ga2V5X2FsZ29yaXRobSAgICAgICAgICAgICA9IFwiUlNBXzIwNDhcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IG5vdF9hZnRlciAgICAgICAgICAgICAgICAgPSBcIjIwMjQtMDktMTVUMjM6NTk6NTlaXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBub3RfYmVmb3JlICAgICAgICAgICAgICAgID0gXCIyMDIzLTA4LTE4VDAwOjAwOjAwWlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gcGVuZGluZ19yZW5ld2FsICAgICAgICAgICA9IGZhbHNlIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gcmVuZXdhbF9lbGlnaWJpbGl0eSAgICAgICA9IFwiRUxJR0lCTEVcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHJlbmV3YWxfc3VtbWFyeSAgICAgICAgICAgPSBbXSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHN0YXR1cyAgICAgICAgICAgICAgICAgICAgPSBcIklTU1VFRFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gc3ViamVjdF9hbHRlcm5hdGl2ZV9uYW1lcyA9IFsgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgICAgICAtIFwid3d3LmluZnJhaG91c2UuY29tXCIsXG4gICAgICAgICAgICAjICgxIHVuY2hhbmdlZCBlbGVtZW50IGhpZGRlbilcbiAgICAgICAgXVxuICAgICAgLSB0YWdzICAgICAgICAgICAgICAgICAgICAgID0ge30gLT4gbnVsbFxuICAgICAgfiB0eXBlICAgICAgICAgICAgICAgICAgICAgID0gXCJBTUFaT05fSVNTVUVEXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiB2YWxpZGF0aW9uX2VtYWlscyAgICAgICAgID0gW10gLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgzIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgLSBvcHRpb25zIHtcbiAgICAgICAgICAtIGNlcnRpZmljYXRlX3RyYW5zcGFyZW5jeV9sb2dnaW5nX3ByZWZlcmVuY2UgPSBcIkVOQUJMRURcIiAtPiBudWxsXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ud2Vic2l0ZSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19hY21fY2VydGlmaWNhdGVfdmFsaWRhdGlvblwiIFwid2Vic2l0ZVwiIHtcbiAgICAgICsgY2VydGlmaWNhdGVfYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB2YWxpZGF0aW9uX3JlY29yZF9mcWRucyA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfYXV0b3NjYWxpbmdfZ3JvdXAud2Vic2l0ZSB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcbiAgfiByZXNvdXJjZSBcImF3c19hdXRvc2NhbGluZ19ncm91cFwiIFwid2Vic2l0ZVwiIHtcbiAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIndlYjIwMjMxMTI1MjA1MjM5NDI4NzAwMDAwMDAzXCJcbiAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIndlYjIwMjMxMTI1MjA1MjM5NDI4NzAwMDAwMDAzXCJcbiAgICAgICAgIyAoMjggdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuXG4gICAgICB+IGxhdW5jaF90ZW1wbGF0ZSB7XG4gICAgICAgICAgICBpZCAgICAgID0gXCJsdC0wNDJlYTVkZDU1YjBmZmYzYlwiXG4gICAgICAgICAgICBuYW1lICAgID0gXCJ3ZWIyMDIzMTEyNTIwNTE1MTIxMzIwMDAwMDAwMVwiXG4gICAgICAgICAgfiB2ZXJzaW9uID0gXCIxXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICB9XG5cbiAgICAgICAgIyAoNyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfbGF1bmNoX3RlbXBsYXRlLndlYnNpdGUgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJhd3NfbGF1bmNoX3RlbXBsYXRlXCIgXCJ3ZWJzaXRlXCIge1xuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICA9IFwibHQtMDQyZWE1ZGQ1NWIwZmZmM2JcIlxuICAgICAgfiBsYXRlc3RfdmVyc2lvbiAgICAgICAgICA9IDEgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICBuYW1lICAgICAgICAgICAgICAgICAgICA9IFwid2ViMjAyMzExMjUyMDUxNTEyMTMyMDAwMDAwMDFcIlxuICAgICAgICB0YWdzICAgICAgICAgICAgICAgICAgICA9IHt9XG4gICAgICB+IHVzZXJfZGF0YSAgICAgICAgICAgICAgID0gXCJRMjl1ZEdWdWRDMVVlWEJsT2lCdGRXeDBhWEJoY25RdmJXbDRaV1E3SUdKdmRXNWtZWEo1UFNKTlNVMUZRazlWVGtSQlVsa2lDazFKVFVVdFZtVnljMmx2YmpvZ01TNHdEUW9OQ2kwdFRVbE5SVUpQVlU1RVFWSlpEUXBEYjI1MFpXNTBMVlJ5WVc1elptVnlMVVZ1WTI5a2FXNW5PaUEzWW1sMERRcERiMjUwWlc1MExWUjVjR1U2SUhSbGVIUXZZMnh2ZFdRdFkyOXVabWxuRFFwTmFXMWxMVlpsY25OcGIyNDZJREV1TUEwS0RRb2pZMnh2ZFdRdFkyOXVabWxuQ2lKaGNIUWlPZ29nSUNKemIzVnlZMlZ6SWpvS0lDQWdJQ0pwYm1aeVlXaHZkWE5sSWpvS0lDQWdJQ0FnSW10bGVTSTZJSHdLSUNBZ0lDQWdJQ0F0TFMwdExVSkZSMGxPSUZCSFVDQlFWVUpNU1VNZ1MwVlpJRUpNVDBOTExTMHRMUzBLQ2lBZ0lDQWdJQ0FnYlZGSlRrSkhVemRHZEd0Q1JVRkVSaXRaYlVSbk5sRjJjM1kxVmpaYVVYY3JVV2g0WkZSMmFrMVlaVXhET1ZRMlVrWlNWa1E1TkRkeFMzcDBUazVSYmdvZ0lDQWdJQ0FnSUN0QkwzbDRjSEpNUVcxWE1qVlZkUzh4TVc5RGMzcE9Wa2xKWVZJelQxazRUWFI1YVd4aVEzUjZWV3RDZW5aWFpHeFlNMGgyVkhjNU1VeHdPR0o0VlV3S0lDQWdJQ0FnSUNCRldFOU5PVzV6WTNGUGNrOTJaa0pxWVc1d2JFdEVSVXRRVFZrMmRrbGFNMnR3TVhKVmMwTk9SMHhDVERCNE1rdGFaMVU0TUhWc1VuTk5UVGh4YmtKT0NpQWdJQ0FnSUNBZ2EzQlVhVUZsV0V0UFJWWjBVbnBzVjJ4MlQwWk1TamR3V1VSMllWb3dWV2RJVTFaMVJTdGFhMnhrY1U5a1RFeFNjRXRyWkVsMlNsQmphMWh4VERWNFZBb2dJQ0FnSUNBZ0lGVjJWMVJYTVdWdVJrRklaRFVyVGxGNFRXNURZVE5wYTJwUlZqTkVWR3hGYW5OblRFeFJZbUo1YzFocVdGQnlObEJKVUhNeU9XTlVZMlp2Y1RRek1VOEtJQ0FnSUNBZ0lDQjBValJFY2xwQ05IWk5SVTlCT0RoVWJVdENhMFZwVFVjcmFVSTVZMnA2TlhkQ1NYVk5kVGsxV20xdlNuaGtkbXBRVWpjeVJsbExaM0pEV0U1MFRtaGtDaUFnSUNBZ0lDQWdWbVZ5UlZKMmNFeFVhR1JoVW0xYVoyazNiSGtyUkhacldUZE1jWGxLVUhaa1NHTnhlR1ZrWjBadVVFdFNORlFyWjFOUmJXSlZVR1E1Y1hGa1NsSXdVUW9nSUNBZ0lDQWdJRXRzTDFCdGRIVlRMM2M1WjNreVdqUmhlVEJSU1V0eVRrSjZVWGhvUVRoTVJGcHdjREZ5ZFdaRFNqVXJXazFsWmprd2RraHdkM2hOSzA5aFVISjVUbXdLSUNBZ0lDQWdJQ0JGWkVSWE4xbFJPR1oxUWpWdVVIRnFkMVZCY0cxc1dWbE1TbGxzWkRkMlNqYzVSVWw0TDNOcVoyZzJSeXRKUm1sdE4zaFNOMWRwVVVZdmJrcGxkbVp4Q2lBZ0lDQWdJQ0FnZG5wWlR6ZHZjaTlIU1VOaU5tVmFkM1pRWkhSNU56bEliVlpsVUhGRlZHeEVWVEF3YjNsdmNGZDVWSE5aZVZOWlJGTkliaTgwWkc5VWRYZzRkaXRHTHdvZ0lDQWdJQ0FnSUZsbGVXSjJaM0ZpY21sSU4ybFRSamhJZUhkRlJtVkVhbkpOZEZWVVNITllRek0xUkVoR1pVMURhRXB2ZUhONVMzWTBPRW9yWWtsSFJuZEJVa0ZSUVVJS0lDQWdJQ0FnSUNCMFF6RktZbTFhZVZsVmFIWmtXRTVzU1VaQ2FGa3lkR2hhTWxaNVNVUjRkMWxYVG5KWlYyUnNZMnRDY0dKdFdubFpWMmgyWkZoT2JFeHRUblppVkRaS0NpQWdJQ0FnSUNBZ1FXeFJSVVYzUlV0QlJEUlhTVkZUYVU1b05XdFpNM2M0VnpCblFVWTRXR2QxU21GdmVHWmpSRGQzVlVOYVRITlhNbEZKWWtGM1ZVcEJPRXB1UVVGVlRBb2dJQ0FnSUNBZ0lFTlJaMGhCWjFsV1EyZHJTVU4zU1VWR1owbEVRVkZKWlVGUlNWaG5RVUZMUTFKRVozVktZVzk0Wm1ORU4zZGlOMFF2T1dWdVluUlBNVVJGVVc0eFVIUUtJQ0FnSUNBZ0lDQm9aMnQwU0N0SmNtSkNaRmxTU0dzM01XbHNNbWhpYm0xQlltOU1hMnN4WVdzdllXRlJXUzlZVVVSS1JtaHlRVGRxVFd0UVRFOURVbVZ2ZEVocFVXMTJDaUFnSUNBZ0lDQWdNVlZtY1VSalRUSmxVVFF2ZURCT09VWXlSRXhWVTJ0MWQzY3hNVGQyZEhSVmIwSjRhWEpDTnpKd1R6QlVMMnhrT1c4ek9WTklUVU12Ukdack5uazJhQW9nSUNBZ0lDQWdJSFJVUjNGNFRHZG9PR296UkZONVR6VkZSWEpLVEdFdk0wSjJUWEZ5TkdseFlqTlFWSGRPWlVSU1JXcGhkbEZLYUZoVGRrVkdhbmxCUTI5dk9XUTNjbk1LSUNBZ0lDQWdJQ0EzYkdoRFltSlRVR3BuVkdOSEwxQkRabnBNY2pNM1VYbDZXR2xVVWk5VWQycHBkMVprVkdoa1ExTXZRMHR1YzI5Tk9HNW5TSGhxV0Zsd1N6ZE5ObmRuQ2lBZ0lDQWdJQ0FnZEhwQk9FcHJTRnB5TlUxd2EzSlFSM0puVVdWMmFFcENUR3RJVWk5cVkzTmhZVUphVGpkdWR6aGhaVWhqZDNkTk5DOURhRWhKZVZwa1VUa3hNRFU1Y0FvZ0lDQWdJQ0FnSUU5TllWbHRWMjFxVUZGbWNURnlUMjVCUVhaQk1YaFhkeXRVV2s1NlNHZFhTWEUwZG5WemVEZFBRblp5Um5OV1pWcE9jM0ZrTjA5aE5IQnlkRlpYWnpBS0lDQWdJQ0FnSUNBNU1XTkxXa3B2TDA5Mk5tOXdUUzkzUkZkT01ubENibXR0UWtOM1lWaHdiMGcxVGtSUk1qSmlhRzVIVkVwbFNWZGtaV2s0VlZOSGNIWkNhMVI0UWtreUNpQWdJQ0FnSUNBZ1dETXljSGxQYlZwRWJqZ3hUREo2VFRKcGIwNTJaMWhKWWpWMU5YUnFZamxPVDJsQmREWnZWekJITUhnd01HUm5jak55Tm5CMU9IRnRUWGRyUWxaQ1F3b2dJQ0FnSUNBZ0lIWlhkMFZ0WVhoUmJtdFVhRzVpUVdRMU4xWmlZWFEwTHk5MVJHTklSbkJFWVVKUWNFWlhaVU5NTW1SbVJGTnlVemxwYVVzMlN6RldhM1pIVEc5WWFEZ0tJQ0FnSUNBZ0lDQk5jRXB4YW05a1pIQm1UbWcwZFhsbWVrdDVUa1V4WkhKUk1qbHRZM2RtU1d4NldHOVFjbUl3T1ZjMldraHdiU3QwY1dRNFRXczNNRGQ2ZDNOa1JrZFNDaUFnSUNBZ0lDQWdjVkp6ZUcxMFVHNDVTakZ5WlZsYWFWWjFSVFZITWpabU1XRkxWRkkzYTBORVVWSnJkWGhpV2tGU1FVRTBLemxyYmpSemJVSllXbU5OTUhaR2NUbFNPQW9nSUNBZ0lDQWdJREkwV0V0YWRGUmhWbTFXYjFaS1RWSlJUVFEwY1ZkU0szTXZVekJOZW5aaVR6VjFNR05UVmxSb1dUWTFXWHBOVEhNNU1qQlZXVFoxUjNCdlV6SmFXWGNLSUNBZ0lDQWdJQ0JKVFdsd2EyRkNLekpHTmtJNFVqZFdOMjVzTDFObllWaEhZVEpOWlhoclF6ZDNkRFppYkVaaVlYYzNjR0oyU1N0cFNUbDNVemhDUzBoblRVUjZaREJHQ2lBZ0lDQWdJQ0FnVkdwVGNUbDJaR3RXYTJZM2VVa3phRVYzYkd4WU4zcFVOa2xNVDNacmJrNUhZbTl6TUdSR1NUa3lZMEpYVVhNcmFWaFFOVEI0UkZacGRETXJPVzFEUkFvZ0lDQWdJQ0FnSUhKMVYxWlphemN6YlhaVFJYcEdZM1ZZUTNsaVMwbzFWUzl1ZWxOUk56QktiMUZ0VTFCak5UQlNVV3AxU0Vka2Vtd3ZXWHBIUm1GR2JqVjZTVm8xY0ZBS0lDQWdJQ0FnSUNCck5WTXJTMVJaWld0NlkybFNhMGg2WW1WaE5WQnFLMEUyUzFwcGJFdHFOWGxyUVZKR2VuY3JRMUI0Y1hOMVpXcEVhMmszUVN0aE0yMHpWMGR4SzIxdENpQWdJQ0FnSUNBZ1FXdHNVVFJaUW1OdmJIcE9UM0JuVjJOc1NWTjFSVE5rTld0bmRHRktRVU5KWjNSbE9EZEdObEZDUW5Ock9HOUVRa1pSUTI1YWJXOVBhWEpzVTJ4aVpnb2dJQ0FnSUNBZ0lFcDFSRFptVmtOS2RUSjZXVGRVYUU0eFR6QnZWMVIzUVdGT1FYWk5OVFZEVEZSMk5uTXpSbTEwVWpreWJHNXNVVVJHZFVvclptbzROak5qTm5GNE1UUUtJQ0FnSUNBZ0lDQkdkVTgwYlUwM1pYVlRNRGgzUjJkV1IyMDVNWGRCTjJKWmJEUmhhSGhETmxNeVFrZENOVVoyYTFwbWVrSkNkMnB6Wm0xVlYwaEJkVGRXVWxwS2VHdFlDaUFnSUNBZ0lDQWdTbkEyT1RaUFZHUlNNMUptU1RkSldqWlBWelowUjBWTWFXcHpkMWRpWWxwWVlqVllVbGRGVnprNWRsZFBOMDVKU3paelQzWm9UVVJPY0RsaVUwMTFZZ29nSUNBZ0lDQWdJRmhRTTFCaVVIaG5lVlF3WW0xemN6QjVkMDVaZDNWamJtWmpiVVJZY1ZCV2RUTkhaSFExTTJGME1TdG9TemR0Ykc1Uk0zVlZjelZsVmtWUFNVaHVTbTBLSUNBZ0lDQWdJQ0JtTVhSeVJHZG5VMVJGTjJadWEzZzJRM3BzSzJsTmEwRkZVVVZCUVZsclExQkJVVmxCVVc5QlNtaFphRUpMU1RKSWJWSnFaa1I0WWxOQlFWaDRaVU0wQ2lBZ0lDQWdJQ0FnYkhGcVJqbDNVSFpDVVVwcmRYaGlXa0ZvYzAxQ1VXdEVkMjFqUVVGQmIwcEZUME0wYkhGcVJqbDNVSFk0VTFGUUwycHpVV1pLUTFWSWNtcHdXRFJtVUFvZ0lDQWdJQ0FnSURCT2RGWjVjV3hEY25FeFQyMU1VRGRDVEhKWWNrTjRiMEZHVW1JMk5GbEtWV1JYYXpWUU16VnJPWGRxTWtKUmFuQnFZMDVxTW1sck9EQkdiMjh3TWtVS0lDQWdJQ0FnSUNCNVl5dFFlbGN2TkhSNlZuWmtlRkp5UlhwelQwWnRLMjFOVWl0c2JGVklRVXQ2UW1FMlVVSjRTRlF3YjJaTU4zQTFXRmxVZFUxT2JsbHZLMUJxVmsxdENpQWdJQ0FnSUNBZ2FsQXpWRVZLUjFsWVdXMTFhRWRtWVdGS1duQnFURzFLUm5Gd05UbDRMeTlrYzAxSVpVeHhWVU5vZDJJMlEyYzJSSFZyUVdsb1pVRnpNMUFyY2xodk13b2dJQ0FnSUNBZ0lIUkNia0UwU2tORGFWaFNOeTh2TUZkbGVsSnZVMUJrWVd4T1pXMDBkbk00VUZRNE4zTnVTR0pFYkdsR1RWWm1PSGNyWm10elNXNXhkbTkwYVZKRVNUUUtJQ0FnSUNBZ0lDQlJRbkpDWm5NelRtUmxXbGN2ZEcxMWNFOWhXa3BTZWtoRWRuWkxZbWN2TDA4MmFYQXhZVkIyU1V4WGRsUkVUVGhMWTFGRFVVVlRZVmRyUTJKSk1YVmpDaUFnSUNBZ0lDQWdjbWw2UVUxaWJGUkNNbWQ1ZHpsNWIycERjRlpEVFVKWVpHbDZRWEZ4ZVd3MVdsWnlkelFyV0M5cE1EbEpjMDUwT0doQk9TODFVbGszZGpOak4xb3lRd29nSUNBZ0lDQWdJRmg1TW5oTFYyMTBURWs1Ym14UFUxTjNWWGhDTlRZMlNUSTViRlpMUWt4VmJWaHRVV1p1VWtsSlNFTnBTa1JZV1VaRVVDODJUR1oyT1N0dGFFVlhWVGdLSUNBZ0lDQWdJQ0J4WldRemVHaHdaVTVUUVVsNlFTdE5WR3hxZEdsU2JXOXllSEJrWkdsWVluUkRZV1pqVUd3dlNqTllNRUl3TjJaalkwcGFkMXB6UTFsRGNIUk1lVEZqQ2lBZ0lDQWdJQ0FnZVhaV1lVNHJSVUp0YW05RGNETnFkRFozVEdVMGVHTnNjVlV6UVVOM2VpODRWRVJFYlhSS04xVlZaR3czVFdScmFYQlJXakkzT0V3eWEzQnNObTgyTVFvZ0lDQWdJQ0FnSUUxR01tWllSRGRtV2sxbFdtWkZkelpzZFRCQ1JqVnRXakF2WTJnelNIaFlaVnB2V0dsbU56bG5NalYyV20xVFpGYzVOM0JqWldWM1VHeDJiRVZVUmxFS0lDQWdJQ0FnSUNBMU5YQk5iM0pSZVZWVVJWRkRVVE5GUTNwSVdWTnVUQzlVYlZjM0NpQWdJQ0FnSUNBZ1BTc3dVbU1LSUNBZ0lDQWdJQ0F0TFMwdExVVk9SQ0JRUjFBZ1VGVkNURWxESUV0RldTQkNURTlEU3kwdExTMHRDaUFnSUNBZ0lDSnpiM1Z5WTJVaU9pQWlaR1ZpSUZ0emFXZHVaV1F0WW5rOUpFdEZXVjlHU1V4RlhTQm9kSFJ3Y3pvdkwzSmxiR1ZoYzJVdGFtRnRiWGt1YVc1bWNtRm9iM1Z6WlM1amIyMHZJQ1JTUlV4RlFWTkZDaUFnSUNBZ0lDQWdiV0ZwYmlJS0luQmhZMnRoWjJWZmRYQmtZWFJsSWpvZ2RISjFaUW9pY0dGamEyRm5aWE1pT2dvdElDSndkWEJ3WlhRdFkyOWtaU0lLTFNBaWFXNW1jbUZvYjNWelpTMTBiMjlzYTJsMElnb2ljSFZ3Y0dWMElqb0tJQ0FpWTI5c2JHVmpkR2x2YmlJNklDSndkWEJ3WlhRNElnb2dJQ0pwYm5OMFlXeHNJam9nZEhKMVpRb2dJQ0pwYm5OMFlXeHNYM1I1Y0dVaU9pQWlZV2x2SWdvZ0lDSndZV05yWVdkbFgyNWhiV1VpT2lBaWNIVndjR1YwTFdGblpXNTBJZ29nSUNKemRHRnlkRjl6WlhKMmFXTmxJam9nWm1Gc2MyVUtJbkoxYm1OdFpDSTZDaTBnTFNBaWFXZ3RjSFZ3Y0dWMElnb2dJQzBnSWkwdFpXNTJhWEp2Ym0xbGJuUWlDaUFnTFNBaWNISnZaSFZqZEdsdmJpSUtJQ0F0SUNJdExXVnVkbWx5YjI1dFpXNTBjR0YwYUNJS0lDQXRJQ0o3Y205dmRGOWthWEpsWTNSdmNubDlMMlZ1ZG1seWIyNXRaVzUwY3lJS0lDQXRJQ0l0TFhKdmIzUXRaR2x5WldOMGIzSjVJZ29nSUMwZ0lpOXZjSFF2Y0hWd2NHVjBMV052WkdVaUNpQWdMU0FpTFMxb2FXVnlZUzFqYjI1bWFXY2lDaUFnTFNBaWUzSnZiM1JmWkdseVpXTjBiM0o1ZlM5bGJuWnBjbTl1YldWdWRITXZlMlZ1ZG1seWIyNXRaVzUwZlM5b2FXVnlZUzU1WVcxc0lnb2dJQzBnSWkwdGJXOWtkV3hsTFhCaGRHZ2lDaUFnTFNBaWUzSnZiM1JmWkdseVpXTjBiM0o1ZlM5dGIyUjFiR1Z6SWdvZ0lDMGdJbUZ3Y0d4NUlnb2lkM0pwZEdWZlptbHNaWE1pT2dvdElDSmpiMjUwWlc1MElqb2dmQzBLSUNBZ0lGdGtaV1poZFd4MFhRb2dJQ0FnY21WbmFXOXVQWFZ6TFhkbGMzUXRNUW9nSUNKd1lYUm9Jam9nSWk5eWIyOTBMeTVoZDNNdlkyOXVabWxuSWdvZ0lDSndaWEp0YVhOemFXOXVjeUk2SUNJd05qQXdJZ290SUNKamIyNTBaVzUwSWpvZ2ZBb2dJQ0FnSW5CMWNIQmxkRjlsYm5acGNtOXViV1Z1ZENJNklDSndjbTlrZFdOMGFXOXVJZ29nSUNBZ0luQjFjSEJsZEY5eWIyeGxJam9nSW5kbFluTmxjblpsY2lJS0lDQWljR0YwYUNJNklDSXZaWFJqTDNCMWNIQmxkR3hoWW5NdlptRmpkR1Z5TDJaaFkzUnpMbVF2Y0hWd2NHVjBMbmxoYld3aUNpQWdJbkJsY20xcGMzTnBiMjV6SWpvZ0lqQTJORFFpQ2kwZ0ltTnZiblJsYm5RaU9pQWllMXdpYVdndGNIVndjR1YwWENJNmUxd2laR1ZpZFdkY0lqcG1ZV3h6WlN4Y0ltVnVkbWx5YjI1dFpXNTBjR0YwYUZ3aU9sd2llM0p2YjNSZlpHbHlaV04wYjNKNWZTOWxiblpwY205dWJXVnVkSE5jSWl4Y0ltaHBaWEpoTFdOdmJtWnBaMXdpT2x3aWUzSnZiM1JmWkdseVpXTjBiM0o1ZlM5bGJuWnBjbTl1YldWdWRITXZlMlZ1ZG1seWIyNXRaVzUwZlM5b2FXVnlZUzU1WVcxc1hDSXNYQ0p0YjJSMWJHVXRjR0YwYUZ3aU9sd2llM0p2YjNSZlpHbHlaV04wYjNKNWZTOXRiMlIxYkdWelhDSXNYQ0p5YjI5MExXUnBjbVZqZEc5eWVWd2lPbHdpTDI5d2RDOXdkWEJ3WlhRdFkyOWtaVndpZlgwaUNpQWdJbkJoZEdnaU9pQWlMMlYwWXk5d2RYQndaWFJzWVdKekwyWmhZM1JsY2k5bVlXTjBjeTVrTDJsb0xYQjFjSEJsZEM1cWMyOXVJZ29nSUNKd1pYSnRhWE56YVc5dWN5STZJQ0l3TmpRMElnb05DaTB0VFVsTlJVSlBWVTVFUVZKWkxTME5DZz09XCIgLT4gXCJRMjl1ZEdWdWRDMVVlWEJsT2lCdGRXeDBhWEJoY25RdmJXbDRaV1E3SUdKdmRXNWtZWEo1UFNKTlNVMUZRazlWVGtSQlVsa2lDazFKVFVVdFZtVnljMmx2YmpvZ01TNHdEUW9OQ2kwdFRVbE5SVUpQVlU1RVFWSlpEUXBEYjI1MFpXNTBMVlJ5WVc1elptVnlMVVZ1WTI5a2FXNW5PaUEzWW1sMERRcERiMjUwWlc1MExWUjVjR1U2SUhSbGVIUXZZMnh2ZFdRdFkyOXVabWxuRFFwTmFXMWxMVlpsY25OcGIyNDZJREV1TUEwS0RRb2pZMnh2ZFdRdFkyOXVabWxuQ2lKaGNIUWlPZ29nSUNKemIzVnlZMlZ6SWpvS0lDQWdJQ0pwYm1aeVlXaHZkWE5sSWpvS0lDQWdJQ0FnSW10bGVTSTZJSHdLSUNBZ0lDQWdJQ0F0TFMwdExVSkZSMGxPSUZCSFVDQlFWVUpNU1VNZ1MwVlpJRUpNVDBOTExTMHRMUzBLQ2lBZ0lDQWdJQ0FnYlZGSlRrSkhVemRHZEd0Q1JVRkVSaXRaYlVSbk5sRjJjM1kxVmpaYVVYY3JVV2g0WkZSMmFrMVlaVXhET1ZRMlVrWlNWa1E1TkRkeFMzcDBUazVSYmdvZ0lDQWdJQ0FnSUN0QkwzbDRjSEpNUVcxWE1qVlZkUzh4TVc5RGMzcE9Wa2xKWVZJelQxazRUWFI1YVd4aVEzUjZWV3RDZW5aWFpHeFlNMGgyVkhjNU1VeHdPR0o0VlV3S0lDQWdJQ0FnSUNCRldFOU5PVzV6WTNGUGNrOTJaa0pxWVc1d2JFdEVSVXRRVFZrMmRrbGFNMnR3TVhKVmMwTk9SMHhDVERCNE1rdGFaMVU0TUhWc1VuTk5UVGh4YmtKT0NpQWdJQ0FnSUNBZ2EzQlVhVUZsV0V0UFJWWjBVbnBzVjJ4MlQwWk1TamR3V1VSMllWb3dWV2RJVTFaMVJTdGFhMnhrY1U5a1RFeFNjRXRyWkVsMlNsQmphMWh4VERWNFZBb2dJQ0FnSUNBZ0lGVjJWMVJYTVdWdVJrRklaRFVyVGxGNFRXNURZVE5wYTJwUlZqTkVWR3hGYW5OblRFeFJZbUo1YzFocVdGQnlObEJKVUhNeU9XTlVZMlp2Y1RRek1VOEtJQ0FnSUNBZ0lDQjBValJFY2xwQ05IWk5SVTlCT0RoVWJVdENhMFZwVFVjcmFVSTVZMnA2TlhkQ1NYVk5kVGsxV20xdlNuaGtkbXBRVWpjeVJsbExaM0pEV0U1MFRtaGtDaUFnSUNBZ0lDQWdWbVZ5UlZKMmNFeFVhR1JoVW0xYVoyazNiSGtyUkhacldUZE1jWGxLVUhaa1NHTnhlR1ZrWjBadVVFdFNORlFyWjFOUmJXSlZVR1E1Y1hGa1NsSXdVUW9nSUNBZ0lDQWdJRXRzTDFCdGRIVlRMM2M1WjNreVdqUmhlVEJSU1V0eVRrSjZVWGhvUVRoTVJGcHdjREZ5ZFdaRFNqVXJXazFsWmprd2RraHdkM2hOSzA5aFVISjVUbXdLSUNBZ0lDQWdJQ0JGWkVSWE4xbFJPR1oxUWpWdVVIRnFkMVZCY0cxc1dWbE1TbGxzWkRkMlNqYzVSVWw0TDNOcVoyZzJSeXRKUm1sdE4zaFNOMWRwVVVZdmJrcGxkbVp4Q2lBZ0lDQWdJQ0FnZG5wWlR6ZHZjaTlIU1VOaU5tVmFkM1pRWkhSNU56bEliVlpsVUhGRlZHeEVWVEF3YjNsdmNGZDVWSE5aZVZOWlJGTkliaTgwWkc5VWRYZzRkaXRHTHdvZ0lDQWdJQ0FnSUZsbGVXSjJaM0ZpY21sSU4ybFRSamhJZUhkRlJtVkVhbkpOZEZWVVNITllRek0xUkVoR1pVMURhRXB2ZUhONVMzWTBPRW9yWWtsSFJuZEJVa0ZSUVVJS0lDQWdJQ0FnSUNCMFF6RktZbTFhZVZsVmFIWmtXRTVzU1VaQ2FGa3lkR2hhTWxaNVNVUjRkMWxYVG5KWlYyUnNZMnRDY0dKdFdubFpWMmgyWkZoT2JFeHRUblppVkRaS0NpQWdJQ0FnSUNBZ1FXeFJSVVYzUlV0QlJEUlhTVkZUYVU1b05XdFpNM2M0VnpCblFVWTRXR2QxU21GdmVHWmpSRGQzVlVOYVRITlhNbEZKWWtGM1ZVcEJPRXB1UVVGVlRBb2dJQ0FnSUNBZ0lFTlJaMGhCWjFsV1EyZHJTVU4zU1VWR1owbEVRVkZKWlVGUlNWaG5RVUZMUTFKRVozVktZVzk0Wm1ORU4zZGlOMFF2T1dWdVluUlBNVVJGVVc0eFVIUUtJQ0FnSUNBZ0lDQm9aMnQwU0N0SmNtSkNaRmxTU0dzM01XbHNNbWhpYm0xQlltOU1hMnN4WVdzdllXRlJXUzlZVVVSS1JtaHlRVGRxVFd0UVRFOURVbVZ2ZEVocFVXMTJDaUFnSUNBZ0lDQWdNVlZtY1VSalRUSmxVVFF2ZURCT09VWXlSRXhWVTJ0MWQzY3hNVGQyZEhSVmIwSjRhWEpDTnpKd1R6QlVMMnhrT1c4ek9WTklUVU12Ukdack5uazJhQW9nSUNBZ0lDQWdJSFJVUjNGNFRHZG9PR296UkZONVR6VkZSWEpLVEdFdk0wSjJUWEZ5TkdseFlqTlFWSGRPWlVSU1JXcGhkbEZLYUZoVGRrVkdhbmxCUTI5dk9XUTNjbk1LSUNBZ0lDQWdJQ0EzYkdoRFltSlRVR3BuVkdOSEwxQkRabnBNY2pNM1VYbDZXR2xVVWk5VWQycHBkMVprVkdoa1ExTXZRMHR1YzI5Tk9HNW5TSGhxV0Zsd1N6ZE5ObmRuQ2lBZ0lDQWdJQ0FnZEhwQk9FcHJTRnB5TlUxd2EzSlFSM0puVVdWMmFFcENUR3RJVWk5cVkzTmhZVUphVGpkdWR6aGhaVWhqZDNkTk5DOURhRWhKZVZwa1VUa3hNRFU1Y0FvZ0lDQWdJQ0FnSUU5TllWbHRWMjFxVUZGbWNURnlUMjVCUVhaQk1YaFhkeXRVV2s1NlNHZFhTWEUwZG5WemVEZFBRblp5Um5OV1pWcE9jM0ZrTjA5aE5IQnlkRlpYWnpBS0lDQWdJQ0FnSUNBNU1XTkxXa3B2TDA5Mk5tOXdUUzkzUkZkT01ubENibXR0UWtOM1lWaHdiMGcxVGtSUk1qSmlhRzVIVkVwbFNWZGtaV2s0VlZOSGNIWkNhMVI0UWtreUNpQWdJQ0FnSUNBZ1dETXljSGxQYlZwRWJqZ3hUREo2VFRKcGIwNTJaMWhKWWpWMU5YUnFZamxPVDJsQmREWnZWekJITUhnd01HUm5jak55Tm5CMU9IRnRUWGRyUWxaQ1F3b2dJQ0FnSUNBZ0lIWlhkMFZ0WVhoUmJtdFVhRzVpUVdRMU4xWmlZWFEwTHk5MVJHTklSbkJFWVVKUWNFWlhaVU5NTW1SbVJGTnlVemxwYVVzMlN6RldhM1pIVEc5WWFEZ0tJQ0FnSUNBZ0lDQk5jRXB4YW05a1pIQm1UbWcwZFhsbWVrdDVUa1V4WkhKUk1qbHRZM2RtU1d4NldHOVFjbUl3T1ZjMldraHdiU3QwY1dRNFRXczNNRGQ2ZDNOa1JrZFNDaUFnSUNBZ0lDQWdjVkp6ZUcxMFVHNDVTakZ5WlZsYWFWWjFSVFZITWpabU1XRkxWRkkzYTBORVVWSnJkWGhpV2tGU1FVRTBLemxyYmpSemJVSllXbU5OTUhaR2NUbFNPQW9nSUNBZ0lDQWdJREkwV0V0YWRGUmhWbTFXYjFaS1RWSlJUVFEwY1ZkU0szTXZVekJOZW5aaVR6VjFNR05UVmxSb1dUWTFXWHBOVEhNNU1qQlZXVFoxUjNCdlV6SmFXWGNLSUNBZ0lDQWdJQ0JKVFdsd2EyRkNLekpHTmtJNFVqZFdOMjVzTDFObllWaEhZVEpOWlhoclF6ZDNkRFppYkVaaVlYYzNjR0oyU1N0cFNUbDNVemhDUzBoblRVUjZaREJHQ2lBZ0lDQWdJQ0FnVkdwVGNUbDJaR3RXYTJZM2VVa3phRVYzYkd4WU4zcFVOa2xNVDNacmJrNUhZbTl6TUdSR1NUa3lZMEpYVVhNcmFWaFFOVEI0UkZacGRETXJPVzFEUkFvZ0lDQWdJQ0FnSUhKMVYxWlphemN6YlhaVFJYcEdZM1ZZUTNsaVMwbzFWUzl1ZWxOUk56QktiMUZ0VTFCak5UQlNVV3AxU0Vka2Vtd3ZXWHBIUm1GR2JqVjZTVm8xY0ZBS0lDQWdJQ0FnSUNCck5WTXJTMVJaWld0NlkybFNhMGg2WW1WaE5WQnFLMEUyUzFwcGJFdHFOWGxyUVZKR2VuY3JRMUI0Y1hOMVpXcEVhMmszUVN0aE0yMHpWMGR4SzIxdENpQWdJQ0FnSUNBZ1FXdHNVVFJaUW1OdmJIcE9UM0JuVjJOc1NWTjFSVE5rTld0bmRHRktRVU5KWjNSbE9EZEdObEZDUW5Ock9HOUVRa1pSUTI1YWJXOVBhWEpzVTJ4aVpnb2dJQ0FnSUNBZ0lFcDFSRFptVmtOS2RUSjZXVGRVYUU0eFR6QnZWMVIzUVdGT1FYWk5OVFZEVEZSMk5uTXpSbTEwVWpreWJHNXNVVVJHZFVvclptbzROak5qTm5GNE1UUUtJQ0FnSUNBZ0lDQkdkVTgwYlUwM1pYVlRNRGgzUjJkV1IyMDVNWGRCTjJKWmJEUmhhSGhETmxNeVFrZENOVVoyYTFwbWVrSkNkMnB6Wm0xVlYwaEJkVGRXVWxwS2VHdFlDaUFnSUNBZ0lDQWdTbkEyT1RaUFZHUlNNMUptU1RkSldqWlBWelowUjBWTWFXcHpkMWRpWWxwWVlqVllVbGRGVnprNWRsZFBOMDVKU3paelQzWm9UVVJPY0RsaVUwMTFZZ29nSUNBZ0lDQWdJRmhRTTFCaVVIaG5lVlF3WW0xemN6QjVkMDVaZDNWamJtWmpiVVJZY1ZCV2RUTkhaSFExTTJGME1TdG9TemR0Ykc1Uk0zVlZjelZsVmtWUFNVaHVTbTBLSUNBZ0lDQWdJQ0JtTVhSeVJHZG5VMVJGTjJadWEzZzJRM3BzSzJsTmEwRkZVVVZCUVZsclExQkJVVmxCVVc5QlNtaFphRUpMU1RKSWJWSnFaa1I0WWxOQlFWaDRaVU0wQ2lBZ0lDQWdJQ0FnYkhGcVJqbDNVSFpDVVVwcmRYaGlXa0ZvYzAxQ1VXdEVkMjFqUVVGQmIwcEZUME0wYkhGcVJqbDNVSFk0VTFGUUwycHpVV1pLUTFWSWNtcHdXRFJtVUFvZ0lDQWdJQ0FnSURCT2RGWjVjV3hEY25FeFQyMU1VRGRDVEhKWWNrTjRiMEZHVW1JMk5GbEtWV1JYYXpWUU16VnJPWGRxTWtKUmFuQnFZMDVxTW1sck9EQkdiMjh3TWtVS0lDQWdJQ0FnSUNCNVl5dFFlbGN2TkhSNlZuWmtlRkp5UlhwelQwWnRLMjFOVWl0c2JGVklRVXQ2UW1FMlVVSjRTRlF3YjJaTU4zQTFXRmxVZFUxT2JsbHZLMUJxVmsxdENpQWdJQ0FnSUNBZ2FsQXpWRVZLUjFsWVdXMTFhRWRtWVdGS1duQnFURzFLUm5Gd05UbDRMeTlrYzAxSVpVeHhWVU5vZDJJMlEyYzJSSFZyUVdsb1pVRnpNMUFyY2xodk13b2dJQ0FnSUNBZ0lIUkNia0UwU2tORGFWaFNOeTh2TUZkbGVsSnZVMUJrWVd4T1pXMDBkbk00VUZRNE4zTnVTR0pFYkdsR1RWWm1PSGNyWm10elNXNXhkbTkwYVZKRVNUUUtJQ0FnSUNBZ0lDQlJRbkpDWm5NelRtUmxXbGN2ZEcxMWNFOWhXa3BTZWtoRWRuWkxZbWN2TDA4MmFYQXhZVkIyU1V4WGRsUkVUVGhMWTFGRFVVVlRZVmRyUTJKSk1YVmpDaUFnSUNBZ0lDQWdjbWw2UVUxaWJGUkNNbWQ1ZHpsNWIycERjRlpEVFVKWVpHbDZRWEZ4ZVd3MVdsWnlkelFyV0M5cE1EbEpjMDUwT0doQk9TODFVbGszZGpOak4xb3lRd29nSUNBZ0lDQWdJRmg1TW5oTFYyMTBURWs1Ym14UFUxTjNWWGhDTlRZMlNUSTViRlpMUWt4VmJWaHRVV1p1VWtsSlNFTnBTa1JZV1VaRVVDODJUR1oyT1N0dGFFVlhWVGdLSUNBZ0lDQWdJQ0J4WldRemVHaHdaVTVUUVVsNlFTdE5WR3hxZEdsU2JXOXllSEJrWkdsWVluUkRZV1pqVUd3dlNqTllNRUl3TjJaalkwcGFkMXB6UTFsRGNIUk1lVEZqQ2lBZ0lDQWdJQ0FnZVhaV1lVNHJSVUp0YW05RGNETnFkRFozVEdVMGVHTnNjVlV6UVVOM2VpODRWRVJFYlhSS04xVlZaR3czVFdScmFYQlJXakkzT0V3eWEzQnNObTgyTVFvZ0lDQWdJQ0FnSUUxR01tWllSRGRtV2sxbFdtWkZkelpzZFRCQ1JqVnRXakF2WTJnelNIaFlaVnB2V0dsbU56bG5NalYyV20xVFpGYzVOM0JqWldWM1VHeDJiRVZVUmxFS0lDQWdJQ0FnSUNBMU5YQk5iM0pSZVZWVVJWRkRVVE5GUTNwSVdWTnVUQzlVYlZjM0NpQWdJQ0FnSUNBZ1BTc3dVbU1LSUNBZ0lDQWdJQ0F0TFMwdExVVk9SQ0JRUjFBZ1VGVkNURWxESUV0RldTQkNURTlEU3kwdExTMHRDaUFnSUNBZ0lDSnpiM1Z5WTJVaU9pQWlaR1ZpSUZ0emFXZHVaV1F0WW5rOUpFdEZXVjlHU1V4RlhTQm9kSFJ3Y3pvdkwzSmxiR1ZoYzJVdGFtRnRiWGt1YVc1bWNtRm9iM1Z6WlM1amIyMHZJQ1JTUlV4RlFWTkZDaUFnSUNBZ0lDQWdiV0ZwYmlJS0luQmhZMnRoWjJWZmRYQmtZWFJsSWpvZ2RISjFaUW9pY0dGamEyRm5aWE1pT2dvdElDSndkWEJ3WlhRdFkyOWtaU0lLTFNBaWFXNW1jbUZvYjNWelpTMTBiMjlzYTJsMElnb3RJQ0pwYm1aeVlXaHZkWE5sTFhCMWNIQmxkQzFrWVhSaElnb2ljSFZ3Y0dWMElqb0tJQ0FpWTI5c2JHVmpkR2x2YmlJNklDSndkWEJ3WlhRNElnb2dJQ0pwYm5OMFlXeHNJam9nZEhKMVpRb2dJQ0pwYm5OMFlXeHNYM1I1Y0dVaU9pQWlZV2x2SWdvZ0lDSndZV05yWVdkbFgyNWhiV1VpT2lBaWNIVndjR1YwTFdGblpXNTBJZ29nSUNKemRHRnlkRjl6WlhKMmFXTmxJam9nWm1Gc2MyVUtJbkoxYm1OdFpDSTZDaTBnTFNBaWFXZ3RjSFZ3Y0dWMElnb2dJQzBnSWkwdFpXNTJhWEp2Ym0xbGJuUWlDaUFnTFNBaWNISnZaSFZqZEdsdmJpSUtJQ0F0SUNJdExXVnVkbWx5YjI1dFpXNTBjR0YwYUNJS0lDQXRJQ0o3Y205dmRGOWthWEpsWTNSdmNubDlMMlZ1ZG1seWIyNXRaVzUwY3lJS0lDQXRJQ0l0TFhKdmIzUXRaR2x5WldOMGIzSjVJZ29nSUMwZ0lpOXZjSFF2Y0hWd2NHVjBMV052WkdVaUNpQWdMU0FpTFMxb2FXVnlZUzFqYjI1bWFXY2lDaUFnTFNBaUwyOXdkQzlwYm1aeVlXaHZkWE5sTFhCMWNIQmxkQzFrWVhSaEwyVnVkbWx5YjI1dFpXNTBjeTl3Y205a2RXTjBhVzl1TDJocFpYSmhMbmxoYld3aUNpQWdMU0FpTFMxdGIyUjFiR1V0Y0dGMGFDSUtJQ0F0SUNKN2NtOXZkRjlrYVhKbFkzUnZjbmw5TDIxdlpIVnNaWE1pQ2lBZ0xTQWlZWEJ3YkhraUNpSjNjbWwwWlY5bWFXeGxjeUk2Q2kwZ0ltTnZiblJsYm5RaU9pQjhMUW9nSUNBZ1cyUmxabUYxYkhSZENpQWdJQ0J5WldkcGIyNDlkWE10ZDJWemRDMHhDaUFnSW5CaGRHZ2lPaUFpTDNKdmIzUXZMbUYzY3k5amIyNW1hV2NpQ2lBZ0luQmxjbTFwYzNOcGIyNXpJam9nSWpBMk1EQWlDaTBnSW1OdmJuUmxiblFpT2lCOENpQWdJQ0FpY0hWd2NHVjBYMlZ1ZG1seWIyNXRaVzUwSWpvZ0luQnliMlIxWTNScGIyNGlDaUFnSUNBaWNIVndjR1YwWDNKdmJHVWlPaUFpZDJWaWMyVnlkbVZ5SWdvZ0lDSndZWFJvSWpvZ0lpOWxkR012Y0hWd2NHVjBiR0ZpY3k5bVlXTjBaWEl2Wm1GamRITXVaQzl3ZFhCd1pYUXVlV0Z0YkNJS0lDQWljR1Z5YldsemMybHZibk1pT2lBaU1EWTBOQ0lLTFNBaVkyOXVkR1Z1ZENJNklDSjdYQ0pwYUMxd2RYQndaWFJjSWpwN1hDSmtaV0oxWjF3aU9tWmhiSE5sTEZ3aVpXNTJhWEp2Ym0xbGJuUndZWFJvWENJNlhDSjdjbTl2ZEY5a2FYSmxZM1J2Y25sOUwyVnVkbWx5YjI1dFpXNTBjMXdpTEZ3aWFHbGxjbUV0WTI5dVptbG5YQ0k2WENJdmIzQjBMMmx1Wm5KaGFHOTFjMlV0Y0hWd2NHVjBMV1JoZEdFdlpXNTJhWEp2Ym0xbGJuUnpMM0J5YjJSMVkzUnBiMjR2YUdsbGNtRXVlV0Z0YkZ3aUxGd2liVzlrZFd4bExYQmhkR2hjSWpwY0ludHliMjkwWDJScGNtVmpkRzl5ZVgwdmJXOWtkV3hsYzF3aUxGd2ljbTl2ZEMxa2FYSmxZM1J2Y25sY0lqcGNJaTl2Y0hRdmNIVndjR1YwTFdOdlpHVmNJbjE5SWdvZ0lDSndZWFJvSWpvZ0lpOWxkR012Y0hWd2NHVjBiR0ZpY3k5bVlXTjBaWEl2Wm1GamRITXVaQzlwYUMxd2RYQndaWFF1YW5OdmJpSUtJQ0FpY0dWeWJXbHpjMmx2Ym5NaU9pQWlNRFkwTkNJS0RRb3RMVTFKVFVWQ1QxVk9SRUZTV1MwdERRbz1cIlxuICAgICAgICAjICgxMSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG5cbiAgICAgICAgIyAoMiB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfbGJfbGlzdGVuZXIuc3NsIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX2xiX2xpc3RlbmVyXCIgXCJzc2xcIiB7XG4gICAgICB+IGNlcnRpZmljYXRlX2FybiAgID0gXCJhcm46YXdzOmFjbTp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlLzdmNTAxYTNlLWU5M2EtNGQ5Ny05OWUzLWM2YmY1NzNjNTliZVwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgaWQgICAgICAgICAgICAgICAgPSBcImFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsaXN0ZW5lci9hcHAvd2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgvMDNhNjRiOGZjOWYwZjA1NS80NmFmYWE3MTJhZTlmYjcwXCJcbiAgICAgICAgdGFncyAgICAgICAgICAgICAgPSB7fVxuICAgICAgICAjICg2IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgICAjICgxIHVuY2hhbmdlZCBibG9jayBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLndlYnNpdGUuYXdzX3JvdXRlNTNfcmVjb3JkLmFwZXhbMF0gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJhd3Nfcm91dGU1M19yZWNvcmRcIiBcImFwZXhcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJaMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fQVwiXG4gICAgICAgIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLmNvbVwiXG4gICAgICB+IHJlY29yZHMgICAgICAgICAgICAgICAgICAgICAgICAgID0gW1xuICAgICAgICAgIC0gXCIxMy41Ny4xMTEuNzdcIixcbiAgICAgICAgICAtIFwiNTQuMjQxLjEzNC4yMDNcIixcbiAgICAgICAgXSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICMgKDUgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS53ZWJzaXRlLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJpbmZyYWhvdXNlLmNvbVwiXSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19yb3V0ZTUzX3JlY29yZFwiIFwiY2VydF92YWxpZGF0aW9uXCIge1xuICAgICAgKyBhbGxvd19vdmVyd3JpdGUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGZxZG4gICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlY29yZHMgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdHRsICAgICAgICAgICAgID0gNjBcbiAgICAgICsgdHlwZSAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB6b25lX2lkICAgICAgICAgPSBcIlowNzY2MjI1MUxIM1lSRjJFUk0zR1wiXG4gICAgfVxuXG5QbGFuOiAzIHRvIGFkZCwgNCB0byBjaGFuZ2UsIDEgdG8gZGVzdHJveS5cblxuXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXG5cblNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuXG5cblRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OlxuICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIlxuOjpkZWJ1Zzo6VGVycmFmb3JtIGV4aXRlZCB3aXRoIGNvZGUgMC5cbjo6ZGVidWc6OnN0ZG91dDogZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC53ZWJzZXJ2ZXJfcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LndlYnNlcnZlcl9wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjIxODMxNTQwMl0lMEFtb2R1bGUuY2RuLmF3c19hY21fY2VydGlmaWNhdGUuY2RuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmFjbTp1cy1lYXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlL2EwOTIwMWVhLWU4M2QtNDNhYi04YWJkLTc1MDA0YjdkNWFhNV0lMEFtb2R1bGUuY2RuLmRhdGEuYXdzX3JvdXRlNTNfem9uZS5paF9jb206IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19rZXlfcGFpci5hbGVrczogUmVhZGluZy4uLiUwQW1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX3BvbGljeS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS93ZWJzZXJ2ZXIyMDIzMDgxODE3MDgwODgwMTUwMDAwMDAwMl0lMEFkYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNpdGUuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNpdGUtdnBjLmRhdGEuYXdzX3ZwYy5tYW5hZ2VtZW50X3ZwY1swXTogUmVhZGluZy4uLiUwQW1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfdnBjLnZwYzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dnBjLTBhZTc5OGY5NDFiZTQ1MzQ1XSUwQW1vZHVsZS5jZG4uYXdzX2Nsb3VkZnJvbnRfY2FjaGVfcG9saWN5LmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVhNzQyZmZmLTNlYjMtNDQzNy1iZmNlLTJlZjQzMWFmY2ZjY10lMEFtb2R1bGUud2Vic2l0ZS5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4NTExMTk0MjddJTBBbW9kdWxlLndlYnNlcnZlcl91c2VyZGF0YS5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS53ZWJzZXJ2ZXJfdXNlcmRhdGEuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFkYXRhLmF3c19yb3V0ZTUzX3pvbmUuaW5mcmFob3VzZV9jb206IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDkzMzcwODI2NDI0XSUwQW1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX3JvbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2VydmVyMjAyMzA4MTgxNzA4MDg3OTQyMDAwMDAwMDFdJTBBbW9kdWxlLndlYnNlcnZlcl91c2VyZGF0YS5kYXRhLmNsb3VkaW5pdF9jb25maWcuY29uZmlnOiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNlcnZlcl91c2VyZGF0YS5kYXRhLmNsb3VkaW5pdF9jb25maWcuY29uZmlnOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zOTg3MTAxNDMwXSUwQW1vZHVsZS5jZG4uYXdzX2Nsb3VkZnJvbnRfZGlzdHJpYnV0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUUyUzhFWElBTkZTUDhFXSUwQW1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2VydmVyMjAyMzA4MTgxNzA4MDg3OTQyMDAwMDAwMDEtMjAyMzA4MTgxNzA4MDkzNDI1MDAwMDAwMDRdJTBBbW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1faW5zdGFuY2VfcHJvZmlsZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzZXJ2ZXJdJTBBZGF0YS5hd3Nfa2V5X3BhaXIuYWxla3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWtleS0wMWM5OGI5NzIzYjUxODA2MV0lMEFkYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19laXAubmF0X2VpcFtcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wM2FkMjJhNDE5OWEyYmZlNV0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVpcGFsbG9jLTBiZWIwODBlNDZlZmViOTNmXSUwQWRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFtaS0wZmZjMDk2NWE3MDU0MTNjOF0lMEFtb2R1bGUud2Vic2l0ZS5hd3NfbGF1bmNoX3RlbXBsYXRlLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWx0LTA0MmVhNWRkNTViMGZmZjNiXSUwQW1vZHVsZS5jZG4uZGF0YS5hd3Nfcm91dGU1M196b25lLmloX2NvbTogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXSUwQW1vZHVsZS5jZG4uYXdzX3JvdXRlNTNfcmVjb3JkLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19jZG4uaW5mcmFob3VzZS5jb21fQV0lMEFtb2R1bGUuY2RuLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJjZG4uaW5mcmFob3VzZS5jb21cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19fYTcxZGJkMGVjZmMwNjBkMzE3OTQ0ZTNiZTFkYmY1OWIuY2RuLmluZnJhaG91c2UuY29tLl9DTkFNRV0lMEFkYXRhLmF3c19yb3V0ZTUzX3pvbmUuaW5mcmFob3VzZV9jb206IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR10lMEFtb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19yb3V0ZTUzX3pvbmUud2Vic2VydmVyX3pvbmU6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2l0ZS12cGMuZGF0YS5hd3NfdnBjLm1hbmFnZW1lbnRfdnBjWzBdOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD12cGMtMDhlMTlkODU5YzI2ZDE4YjJdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmRhdGEuYXdzX3JvdXRlX3RhYmxlcy5tZ210X3JvdXRlX3RhYmxlc1swXTogUmVhZGluZy4uLiUwQW1vZHVsZS5jZG4uYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTIwMjMtMDgtMjEgMjM6MzM6NTguNjYzICswMDAwIFVUQ10lMEFtb2R1bGUud2Vic2l0ZS12cGMuZGF0YS5hd3Nfcm91dGVfdGFibGVzLm1nbXRfcm91dGVfdGFibGVzWzBdOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19zdWJuZXQuYWxsW1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wODZjY2YxYjc4NDIyNDNkMl0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX2RlZmF1bHRfcm91dGVfdGFibGUuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTA2YjcwMmJkYjBjYWRkODEwXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDEzMDZmYTllMTRmOWM5ODBdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBmYzY1Njc1ZTVjZTA3YmJmXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuNy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDZmMzUyMTg1ZmZjM2ZjZDNdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19zdWJuZXQuYWxsW1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wNWZhMzMxNjRjNzY4YWI2NV0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX2RlZmF1bHRfc2VjdXJpdHlfZ3JvdXAuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDg5ZjFhODVmMDVjYmQzMmFdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c192cGNfcGVlcmluZ19jb25uZWN0aW9uLmxpbmtfdG9fbWFuYWdlbWVudFswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cGN4LTBmZDAwMDA4ZTlhODkwYjM1XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfaW50ZXJuZXRfZ2F0ZXdheS5pZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWd3LTBmZWI4ZjU3OTA0OGZjNDQzXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wMmFlOWZjMzQ5MzI0ODM1Yl0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGRlY2JiZjAxODIzODRkZmZdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjcuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBmMGQ0YWI2NjUwZWQ0N2E0XSUwQW1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX3JvdXRlNTNfem9uZS53ZWJzZXJ2ZXJfem9uZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXSUwQW1vZHVsZS53ZWJzaXRlLmF3c19hY21fY2VydGlmaWNhdGUud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czphY206dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpjZXJ0aWZpY2F0ZS83ZjUwMWEzZS1lOTNhLTRkOTctOTllMy1jNmJmNTczYzU5YmVdJTBBbW9kdWxlLndlYnNpdGUuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTBhMWMxNjAxMjc0N2VmNWU0XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wMGFjMTlhZTQzNTYyMzUyZl0lMEFtb2R1bGUud2Vic2l0ZS5hd3NfYWxiLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsb2FkYmFsYW5jZXIvYXBwL3dlYjIwMjMwODE4MTcwODIxMzE3MTAwMDAwMDA4LzAzYTY0YjhmYzlmMGYwNTVdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21nbXRfdG9fbWVbMV06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA0YTE2ZTc0ZDViMTJhMzM4MzE3Nzk1NzMzNF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWdtdF90b19tZVsyXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTkzMTc3OTU3MzM0XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUucm91dGVfZnJvbV9tZ210X3RvX21lWzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZDczMzgzYWZlYjZhZDE0MjMxNzc5NTczMzRdJTBBbW9kdWxlLndlYnNpdGUuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1zdWJuZXQtMDg2Y2NmMWI3ODQyMjQzZDJdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5kZWZhdWx0X21haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA2YjcwMmJkYjBjYWRkODEwMTA4MDI4OTQ5NF0lMEFtb2R1bGUud2Vic2l0ZS5hd3NfYWxiX3RhcmdldF9ncm91cC53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6dGFyZ2V0Z3JvdXAvdGYtMjAyMzA4MTgxNzA4MjE0MDEyMDAwMDAwMGEvNGJhYjFjODc0ZGI3NDBhZl0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnN1Ym5ldF9wdWJsaWNbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGZjNjU2NzVlNWNlMDdiYmYxMDgwMjg5NDk0XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wMmFlOWZjMzQ5MzI0ODM1YjEwODAyODk0OTRdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21lX3RvX21nbXRbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGZjNjU2NzVlNWNlMDdiYmY2NTM5NTI0NDhdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21lX3RvX21nbXRbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDJhZTlmYzM0OTMyNDgzNWI2NTM5NTI0NDhdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21lX3RvX21nbXRbXCIxMC4wLjYuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGRlY2JiZjAxODIzODRkZmY2NTM5NTI0NDhdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21lX3RvX21nbXRbXCIxMC4wLjcuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGYwZDRhYjY2NTBlZDQ3YTQ2NTM5NTI0NDhdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC42LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTBjMWEzZTRjODc0MzMzYmFmXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuNy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wZGEwZmVhN2Q5OTlmY2Y1Zl0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMDRkNzExYTRiOTI4OTZiZTJdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTA3MTYwNDViYTVlYjA5MmYwXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUuc3VibmV0X3ByaXZhdGVbXCIxMC4wLjYuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGRlY2JiZjAxODIzODRkZmYxMDgwMjg5NDk0XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUuc3VibmV0X3ByaXZhdGVbXCIxMC4wLjcuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGYwZDRhYjY2NTBlZDQ3YTQxMDgwMjg5NDk0XSUwQW1vZHVsZS53ZWJzaXRlLmF3c19hbGJfbGlzdGVuZXIucmVkaXJlY3RfdG9fc3NsOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bGlzdGVuZXIvYXBwL3dlYjIwMjMwODE4MTcwODIxMzE3MTAwMDAwMDA4LzAzYTY0YjhmYzlmMGYwNTUvM2Q5ODRiYzlmMWNjM2E3ZF0lMEFtb2R1bGUud2Vic2l0ZS5hd3NfbGJfbGlzdGVuZXIuc3NsOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bGlzdGVuZXIvYXBwL3dlYjIwMjMwODE4MTcwODIxMzE3MTAwMDAwMDA4LzAzYTY0YjhmYzlmMGYwNTUvNDZhZmFhNzEyYWU5ZmI3MF0lMEFtb2R1bGUud2Vic2l0ZS5hd3NfYXV0b3NjYWxpbmdfZ3JvdXAud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2ViMjAyMzExMjUyMDUyMzk0Mjg3MDAwMDAwMDNdJTBBbW9kdWxlLndlYnNpdGUuYXdzX2F1dG9zY2FsaW5nX3BvbGljeS5jcHVfbG9hZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2ViMjAyMzExMjUyMDUyMzk0Mjg3MDAwMDAwMDNdJTBBbW9kdWxlLndlYnNpdGUuYXdzX3JvdXRlNTNfcmVjb3JkLmFwZXhbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9BXSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICArIGNyZWF0ZSUwQSAgfiB1cGRhdGUgaW4tcGxhY2UlMEEtLysgZGVzdHJveSBhbmQgdGhlbiBjcmVhdGUgcmVwbGFjZW1lbnQlMEEgPD0gcmVhZCAoZGF0YSByZXNvdXJjZXMpJTBBJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBICAjIG1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX25ldHdvcmtfaW50ZXJmYWNlLmFsYlswXSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5JTBBICAjIChkZXBlbmRzIG9uIGEgcmVzb3VyY2Ugb3IgYSBtb2R1bGUgd2l0aCBjaGFuZ2VzIHBlbmRpbmcpJTBBIDw9IGRhdGEgXCJhd3NfbmV0d29ya19pbnRlcmZhY2VcIiBcImFsYlwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXNzb2NpYXRpb24gICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhdHRhY2htZW50ICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGF2YWlsYWJpbGl0eV96b25lID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGludGVyZmFjZV90eXBlICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaXB2Nl9hZGRyZXNzZXMgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYWNfYWRkcmVzcyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHBvc3RfYXJuICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3duZXJfaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwcml2YXRlX2Ruc19uYW1lICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHByaXZhdGVfaXAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHJpdmF0ZV9pcHMgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZXF1ZXN0ZXJfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNlY3VyaXR5X2dyb3VwcyAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3VibmV0X2lkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHZwY19pZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSUwQSAgICAgICsgZmlsdGVyIHslMEEgICAgICAgICAgKyBuYW1lICAgPSBcImRlc2NyaXB0aW9uXCIlMEEgICAgICAgICAgKyB2YWx1ZXMgPSBbJTBBICAgICAgICAgICAgICArIFwiRUxCIGFwcC93ZWIyMDIzMDgxODE3MDgyMTMxNzEwMDAwMDAwOC8wM2E2NGI4ZmM5ZjBmMDU1XCIsJTBBICAgICAgICAgICAgXSUwQSAgICAgICAgfSUwQSAgICAgICsgZmlsdGVyIHslMEEgICAgICAgICAgKyBuYW1lICAgPSBcInN1Ym5ldC1pZFwiJTBBICAgICAgICAgICsgdmFsdWVzID0gWyUwQSAgICAgICAgICAgICAgKyBcInN1Ym5ldC0wODZjY2YxYjc4NDIyNDNkMlwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19uZXR3b3JrX2ludGVyZmFjZS5hbGJbMV0gd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseSUwQSAgIyAoZGVwZW5kcyBvbiBhIHJlc291cmNlIG9yIGEgbW9kdWxlIHdpdGggY2hhbmdlcyBwZW5kaW5nKSUwQSA8PSBkYXRhIFwiYXdzX25ldHdvcmtfaW50ZXJmYWNlXCIgXCJhbGJcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGFzc29jaWF0aW9uICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXR0YWNobWVudCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhdmFpbGFiaWxpdHlfem9uZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpbnRlcmZhY2VfdHlwZSAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlwdjZfYWRkcmVzc2VzICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWFjX2FkZHJlc3MgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwb3N0X2FybiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG93bmVyX2lkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHJpdmF0ZV9kbnNfbmFtZSAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwcml2YXRlX2lwICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHByaXZhdGVfaXBzICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVxdWVzdGVyX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzZWN1cml0eV9ncm91cHMgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN1Ym5ldF9pZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB2cGNfaWQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIGZpbHRlciB7JTBBICAgICAgICAgICsgbmFtZSAgID0gXCJkZXNjcmlwdGlvblwiJTBBICAgICAgICAgICsgdmFsdWVzID0gWyUwQSAgICAgICAgICAgICAgKyBcIkVMQiBhcHAvd2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgvMDNhNjRiOGZjOWYwZjA1NVwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgIH0lMEEgICAgICArIGZpbHRlciB7JTBBICAgICAgICAgICsgbmFtZSAgID0gXCJzdWJuZXQtaWRcIiUwQSAgICAgICAgICArIHZhbHVlcyA9IFslMEEgICAgICAgICAgICAgICsgXCJzdWJuZXQtMDVmYTMzMTY0Yzc2OGFiNjVcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLndlYnNpdGUuYXdzX2FjbV9jZXJ0aWZpY2F0ZS53ZWJzaXRlIG11c3QgYmUgcmVwbGFjZWQlMEEtLysgcmVzb3VyY2UgXCJhd3NfYWNtX2NlcnRpZmljYXRlXCIgXCJ3ZWJzaXRlXCIgeyUwQSAgICAgIH4gYXJuICAgICAgICAgICAgICAgICAgICAgICA9IFwiYXJuOmF3czphY206dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpjZXJ0aWZpY2F0ZS83ZjUwMWEzZS1lOTNhLTRkOTctOTllMy1jNmJmNTczYzU5YmVcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBkb21haW5fdmFsaWRhdGlvbl9vcHRpb25zID0gWyUwQSAgICAgICAgICAtIHslMEEgICAgICAgICAgICAgIC0gZG9tYWluX25hbWUgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLmNvbVwiJTBBICAgICAgICAgICAgICAtIHJlc291cmNlX3JlY29yZF9uYW1lICA9IFwiXzc1MDRjNWM3YmRjNDlhNmJkY2FkNTBmYzdkNmI0Njk3LmluZnJhaG91c2UuY29tLlwiJTBBICAgICAgICAgICAgICAtIHJlc291cmNlX3JlY29yZF90eXBlICA9IFwiQ05BTUVcIiUwQSAgICAgICAgICAgICAgLSByZXNvdXJjZV9yZWNvcmRfdmFsdWUgPSBcIl8xNmY2ZGVhYmQ1MmU3NmQ0ZWY2MWU4MGVjNDM2YjVkZi5zaHpiZndjZ2dwLmFjbS12YWxpZGF0aW9ucy5hd3MuXCIlMEEgICAgICAgICAgICB9LCUwQSAgICAgICAgICAtIHslMEEgICAgICAgICAgICAgIC0gZG9tYWluX25hbWUgICAgICAgICAgID0gXCJ3d3cuaW5mcmFob3VzZS5jb21cIiUwQSAgICAgICAgICAgICAgLSByZXNvdXJjZV9yZWNvcmRfbmFtZSAgPSBcIl9jOTA1NTZiZGYyYTdmNzg5NDAxZjFlYzA1YTBjYjU2MC53d3cuaW5mcmFob3VzZS5jb20uXCIlMEEgICAgICAgICAgICAgIC0gcmVzb3VyY2VfcmVjb3JkX3R5cGUgID0gXCJDTkFNRVwiJTBBICAgICAgICAgICAgICAtIHJlc291cmNlX3JlY29yZF92YWx1ZSA9IFwiX2E3MDk0NThmYmU0NWI3ZGM1OTljZGMzNTdmNGQ4MWI4LnNoemJmd2NnZ3AuYWNtLXZhbGlkYXRpb25zLmF3cy5cIiUwQSAgICAgICAgICAgIH0sJTBBICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgKyBkb21haW5fbmFtZSAgICAgICAgICAgPSBcImluZnJhaG91c2UuY29tXCIlMEEgICAgICAgICAgICAgICsgcmVzb3VyY2VfcmVjb3JkX25hbWUgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgICAgKyByZXNvdXJjZV9yZWNvcmRfdHlwZSAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgICArIHJlc291cmNlX3JlY29yZF92YWx1ZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgICB9LCUwQSAgICAgICAgXSUwQSAgICAgIH4gaWQgICAgICAgICAgICAgICAgICAgICAgICA9IFwiYXJuOmF3czphY206dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpjZXJ0aWZpY2F0ZS83ZjUwMWEzZS1lOTNhLTRkOTctOTllMy1jNmJmNTczYzU5YmVcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBrZXlfYWxnb3JpdGhtICAgICAgICAgICAgID0gXCJSU0FfMjA0OFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IG5vdF9hZnRlciAgICAgICAgICAgICAgICAgPSBcIjIwMjQtMDktMTVUMjM6NTk6NTlaXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gbm90X2JlZm9yZSAgICAgICAgICAgICAgICA9IFwiMjAyMy0wOC0xOFQwMDowMDowMFpcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBwZW5kaW5nX3JlbmV3YWwgICAgICAgICAgID0gZmFsc2UgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gcmVuZXdhbF9lbGlnaWJpbGl0eSAgICAgICA9IFwiRUxJR0lCTEVcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiByZW5ld2FsX3N1bW1hcnkgICAgICAgICAgID0gW10gLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gc3RhdHVzICAgICAgICAgICAgICAgICAgICA9IFwiSVNTVUVEXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gc3ViamVjdF9hbHRlcm5hdGl2ZV9uYW1lcyA9IFsgIyBmb3JjZXMgcmVwbGFjZW1lbnQlMEEgICAgICAgICAgLSBcInd3dy5pbmZyYWhvdXNlLmNvbVwiLCUwQSAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGVsZW1lbnQgaGlkZGVuKSUwQSAgICAgICAgXSUwQSAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGwlMEEgICAgICB+IHR5cGUgICAgICAgICAgICAgICAgICAgICAgPSBcIkFNQVpPTl9JU1NVRURcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiB2YWxpZGF0aW9uX2VtYWlscyAgICAgICAgID0gW10gLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgIyAoMyB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBJTBBICAgICAgLSBvcHRpb25zIHslMEEgICAgICAgICAgLSBjZXJ0aWZpY2F0ZV90cmFuc3BhcmVuY3lfbG9nZ2luZ19wcmVmZXJlbmNlID0gXCJFTkFCTEVEXCIgLT4gbnVsbCUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS53ZWJzaXRlLmF3c19hY21fY2VydGlmaWNhdGVfdmFsaWRhdGlvbi53ZWJzaXRlIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19hY21fY2VydGlmaWNhdGVfdmFsaWRhdGlvblwiIFwid2Vic2l0ZVwiIHslMEEgICAgICArIGNlcnRpZmljYXRlX2FybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB2YWxpZGF0aW9uX3JlY29yZF9mcWRucyA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfYXV0b3NjYWxpbmdfZ3JvdXAud2Vic2l0ZSB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEEgIH4gcmVzb3VyY2UgXCJhd3NfYXV0b3NjYWxpbmdfZ3JvdXBcIiBcIndlYnNpdGVcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwid2ViMjAyMzExMjUyMDUyMzk0Mjg3MDAwMDAwMDNcIiUwQSAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIndlYjIwMjMxMTI1MjA1MjM5NDI4NzAwMDAwMDAzXCIlMEEgICAgICAgICMgKDI4IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEElMEEgICAgICB+IGxhdW5jaF90ZW1wbGF0ZSB7JTBBICAgICAgICAgICAgaWQgICAgICA9IFwibHQtMDQyZWE1ZGQ1NWIwZmZmM2JcIiUwQSAgICAgICAgICAgIG5hbWUgICAgPSBcIndlYjIwMjMxMTI1MjA1MTUxMjEzMjAwMDAwMDAxXCIlMEEgICAgICAgICAgfiB2ZXJzaW9uID0gXCIxXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgfSUwQSUwQSAgICAgICAgIyAoNyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfbGF1bmNoX3RlbXBsYXRlLndlYnNpdGUgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlJTBBICB+IHJlc291cmNlIFwiYXdzX2xhdW5jaF90ZW1wbGF0ZVwiIFwid2Vic2l0ZVwiIHslMEEgICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgID0gXCJsdC0wNDJlYTVkZDU1YjBmZmYzYlwiJTBBICAgICAgfiBsYXRlc3RfdmVyc2lvbiAgICAgICAgICA9IDEgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgICAgPSBcIndlYjIwMjMxMTI1MjA1MTUxMjEzMjAwMDAwMDAxXCIlMEEgICAgICAgIHRhZ3MgICAgICAgICAgICAgICAgICAgID0ge30lMEEgICAgICB+IHVzZXJfZGF0YSAgICAgICAgICAgICAgID0gXCJRMjl1ZEdWdWRDMVVlWEJsT2lCdGRXeDBhWEJoY25RdmJXbDRaV1E3SUdKdmRXNWtZWEo1UFNKTlNVMUZRazlWVGtSQlVsa2lDazFKVFVVdFZtVnljMmx2YmpvZ01TNHdEUW9OQ2kwdFRVbE5SVUpQVlU1RVFWSlpEUXBEYjI1MFpXNTBMVlJ5WVc1elptVnlMVVZ1WTI5a2FXNW5PaUEzWW1sMERRcERiMjUwWlc1MExWUjVjR1U2SUhSbGVIUXZZMnh2ZFdRdFkyOXVabWxuRFFwTmFXMWxMVlpsY25OcGIyNDZJREV1TUEwS0RRb2pZMnh2ZFdRdFkyOXVabWxuQ2lKaGNIUWlPZ29nSUNKemIzVnlZMlZ6SWpvS0lDQWdJQ0pwYm1aeVlXaHZkWE5sSWpvS0lDQWdJQ0FnSW10bGVTSTZJSHdLSUNBZ0lDQWdJQ0F0TFMwdExVSkZSMGxPSUZCSFVDQlFWVUpNU1VNZ1MwVlpJRUpNVDBOTExTMHRMUzBLQ2lBZ0lDQWdJQ0FnYlZGSlRrSkhVemRHZEd0Q1JVRkVSaXRaYlVSbk5sRjJjM1kxVmpaYVVYY3JVV2g0WkZSMmFrMVlaVXhET1ZRMlVrWlNWa1E1TkRkeFMzcDBUazVSYmdvZ0lDQWdJQ0FnSUN0QkwzbDRjSEpNUVcxWE1qVlZkUzh4TVc5RGMzcE9Wa2xKWVZJelQxazRUWFI1YVd4aVEzUjZWV3RDZW5aWFpHeFlNMGgyVkhjNU1VeHdPR0o0VlV3S0lDQWdJQ0FnSUNCRldFOU5PVzV6WTNGUGNrOTJaa0pxWVc1d2JFdEVSVXRRVFZrMmRrbGFNMnR3TVhKVmMwTk9SMHhDVERCNE1rdGFaMVU0TUhWc1VuTk5UVGh4YmtKT0NpQWdJQ0FnSUNBZ2EzQlVhVUZsV0V0UFJWWjBVbnBzVjJ4MlQwWk1TamR3V1VSMllWb3dWV2RJVTFaMVJTdGFhMnhrY1U5a1RFeFNjRXRyWkVsMlNsQmphMWh4VERWNFZBb2dJQ0FnSUNBZ0lGVjJWMVJYTVdWdVJrRklaRFVyVGxGNFRXNURZVE5wYTJwUlZqTkVWR3hGYW5OblRFeFJZbUo1YzFocVdGQnlObEJKVUhNeU9XTlVZMlp2Y1RRek1VOEtJQ0FnSUNBZ0lDQjBValJFY2xwQ05IWk5SVTlCT0RoVWJVdENhMFZwVFVjcmFVSTVZMnA2TlhkQ1NYVk5kVGsxV20xdlNuaGtkbXBRVWpjeVJsbExaM0pEV0U1MFRtaGtDaUFnSUNBZ0lDQWdWbVZ5UlZKMmNFeFVhR1JoVW0xYVoyazNiSGtyUkhacldUZE1jWGxLVUhaa1NHTnhlR1ZrWjBadVVFdFNORlFyWjFOUmJXSlZVR1E1Y1hGa1NsSXdVUW9nSUNBZ0lDQWdJRXRzTDFCdGRIVlRMM2M1WjNreVdqUmhlVEJSU1V0eVRrSjZVWGhvUVRoTVJGcHdjREZ5ZFdaRFNqVXJXazFsWmprd2RraHdkM2hOSzA5aFVISjVUbXdLSUNBZ0lDQWdJQ0JGWkVSWE4xbFJPR1oxUWpWdVVIRnFkMVZCY0cxc1dWbE1TbGxzWkRkMlNqYzVSVWw0TDNOcVoyZzJSeXRKUm1sdE4zaFNOMWRwVVVZdmJrcGxkbVp4Q2lBZ0lDQWdJQ0FnZG5wWlR6ZHZjaTlIU1VOaU5tVmFkM1pRWkhSNU56bEliVlpsVUhGRlZHeEVWVEF3YjNsdmNGZDVWSE5aZVZOWlJGTkliaTgwWkc5VWRYZzRkaXRHTHdvZ0lDQWdJQ0FnSUZsbGVXSjJaM0ZpY21sSU4ybFRSamhJZUhkRlJtVkVhbkpOZEZWVVNITllRek0xUkVoR1pVMURhRXB2ZUhONVMzWTBPRW9yWWtsSFJuZEJVa0ZSUVVJS0lDQWdJQ0FnSUNCMFF6RktZbTFhZVZsVmFIWmtXRTVzU1VaQ2FGa3lkR2hhTWxaNVNVUjRkMWxYVG5KWlYyUnNZMnRDY0dKdFdubFpWMmgyWkZoT2JFeHRUblppVkRaS0NpQWdJQ0FnSUNBZ1FXeFJSVVYzUlV0QlJEUlhTVkZUYVU1b05XdFpNM2M0VnpCblFVWTRXR2QxU21GdmVHWmpSRGQzVlVOYVRITlhNbEZKWWtGM1ZVcEJPRXB1UVVGVlRBb2dJQ0FnSUNBZ0lFTlJaMGhCWjFsV1EyZHJTVU4zU1VWR1owbEVRVkZKWlVGUlNWaG5RVUZMUTFKRVozVktZVzk0Wm1ORU4zZGlOMFF2T1dWdVluUlBNVVJGVVc0eFVIUUtJQ0FnSUNBZ0lDQm9aMnQwU0N0SmNtSkNaRmxTU0dzM01XbHNNbWhpYm0xQlltOU1hMnN4WVdzdllXRlJXUzlZVVVSS1JtaHlRVGRxVFd0UVRFOURVbVZ2ZEVocFVXMTJDaUFnSUNBZ0lDQWdNVlZtY1VSalRUSmxVVFF2ZURCT09VWXlSRXhWVTJ0MWQzY3hNVGQyZEhSVmIwSjRhWEpDTnpKd1R6QlVMMnhrT1c4ek9WTklUVU12Ukdack5uazJhQW9nSUNBZ0lDQWdJSFJVUjNGNFRHZG9PR296UkZONVR6VkZSWEpLVEdFdk0wSjJUWEZ5TkdseFlqTlFWSGRPWlVSU1JXcGhkbEZLYUZoVGRrVkdhbmxCUTI5dk9XUTNjbk1LSUNBZ0lDQWdJQ0EzYkdoRFltSlRVR3BuVkdOSEwxQkRabnBNY2pNM1VYbDZXR2xVVWk5VWQycHBkMVprVkdoa1ExTXZRMHR1YzI5Tk9HNW5TSGhxV0Zsd1N6ZE5ObmRuQ2lBZ0lDQWdJQ0FnZEhwQk9FcHJTRnB5TlUxd2EzSlFSM0puVVdWMmFFcENUR3RJVWk5cVkzTmhZVUphVGpkdWR6aGhaVWhqZDNkTk5DOURhRWhKZVZwa1VUa3hNRFU1Y0FvZ0lDQWdJQ0FnSUU5TllWbHRWMjFxVUZGbWNURnlUMjVCUVhaQk1YaFhkeXRVV2s1NlNHZFhTWEUwZG5WemVEZFBRblp5Um5OV1pWcE9jM0ZrTjA5aE5IQnlkRlpYWnpBS0lDQWdJQ0FnSUNBNU1XTkxXa3B2TDA5Mk5tOXdUUzkzUkZkT01ubENibXR0UWtOM1lWaHdiMGcxVGtSUk1qSmlhRzVIVkVwbFNWZGtaV2s0VlZOSGNIWkNhMVI0UWtreUNpQWdJQ0FnSUNBZ1dETXljSGxQYlZwRWJqZ3hUREo2VFRKcGIwNTJaMWhKWWpWMU5YUnFZamxPVDJsQmREWnZWekJITUhnd01HUm5jak55Tm5CMU9IRnRUWGRyUWxaQ1F3b2dJQ0FnSUNBZ0lIWlhkMFZ0WVhoUmJtdFVhRzVpUVdRMU4xWmlZWFEwTHk5MVJHTklSbkJFWVVKUWNFWlhaVU5NTW1SbVJGTnlVemxwYVVzMlN6RldhM1pIVEc5WWFEZ0tJQ0FnSUNBZ0lDQk5jRXB4YW05a1pIQm1UbWcwZFhsbWVrdDVUa1V4WkhKUk1qbHRZM2RtU1d4NldHOVFjbUl3T1ZjMldraHdiU3QwY1dRNFRXczNNRGQ2ZDNOa1JrZFNDaUFnSUNBZ0lDQWdjVkp6ZUcxMFVHNDVTakZ5WlZsYWFWWjFSVFZITWpabU1XRkxWRkkzYTBORVVWSnJkWGhpV2tGU1FVRTBLemxyYmpSemJVSllXbU5OTUhaR2NUbFNPQW9nSUNBZ0lDQWdJREkwV0V0YWRGUmhWbTFXYjFaS1RWSlJUVFEwY1ZkU0szTXZVekJOZW5aaVR6VjFNR05UVmxSb1dUWTFXWHBOVEhNNU1qQlZXVFoxUjNCdlV6SmFXWGNLSUNBZ0lDQWdJQ0JKVFdsd2EyRkNLekpHTmtJNFVqZFdOMjVzTDFObllWaEhZVEpOWlhoclF6ZDNkRFppYkVaaVlYYzNjR0oyU1N0cFNUbDNVemhDUzBoblRVUjZaREJHQ2lBZ0lDQWdJQ0FnVkdwVGNUbDJaR3RXYTJZM2VVa3phRVYzYkd4WU4zcFVOa2xNVDNacmJrNUhZbTl6TUdSR1NUa3lZMEpYVVhNcmFWaFFOVEI0UkZacGRETXJPVzFEUkFvZ0lDQWdJQ0FnSUhKMVYxWlphemN6YlhaVFJYcEdZM1ZZUTNsaVMwbzFWUzl1ZWxOUk56QktiMUZ0VTFCak5UQlNVV3AxU0Vka2Vtd3ZXWHBIUm1GR2JqVjZTVm8xY0ZBS0lDQWdJQ0FnSUNCck5WTXJTMVJaWld0NlkybFNhMGg2WW1WaE5WQnFLMEUyUzFwcGJFdHFOWGxyUVZKR2VuY3JRMUI0Y1hOMVpXcEVhMmszUVN0aE0yMHpWMGR4SzIxdENpQWdJQ0FnSUNBZ1FXdHNVVFJaUW1OdmJIcE9UM0JuVjJOc1NWTjFSVE5rTld0bmRHRktRVU5KWjNSbE9EZEdObEZDUW5Ock9HOUVRa1pSUTI1YWJXOVBhWEpzVTJ4aVpnb2dJQ0FnSUNBZ0lFcDFSRFptVmtOS2RUSjZXVGRVYUU0eFR6QnZWMVIzUVdGT1FYWk5OVFZEVEZSMk5uTXpSbTEwVWpreWJHNXNVVVJHZFVvclptbzROak5qTm5GNE1UUUtJQ0FnSUNBZ0lDQkdkVTgwYlUwM1pYVlRNRGgzUjJkV1IyMDVNWGRCTjJKWmJEUmhhSGhETmxNeVFrZENOVVoyYTFwbWVrSkNkMnB6Wm0xVlYwaEJkVGRXVWxwS2VHdFlDaUFnSUNBZ0lDQWdTbkEyT1RaUFZHUlNNMUptU1RkSldqWlBWelowUjBWTWFXcHpkMWRpWWxwWVlqVllVbGRGVnprNWRsZFBOMDVKU3paelQzWm9UVVJPY0RsaVUwMTFZZ29nSUNBZ0lDQWdJRmhRTTFCaVVIaG5lVlF3WW0xemN6QjVkMDVaZDNWamJtWmpiVVJZY1ZCV2RUTkhaSFExTTJGME1TdG9TemR0Ykc1Uk0zVlZjelZsVmtWUFNVaHVTbTBLSUNBZ0lDQWdJQ0JtTVhSeVJHZG5VMVJGTjJadWEzZzJRM3BzSzJsTmEwRkZVVVZCUVZsclExQkJVVmxCVVc5QlNtaFphRUpMU1RKSWJWSnFaa1I0WWxOQlFWaDRaVU0wQ2lBZ0lDQWdJQ0FnYkhGcVJqbDNVSFpDVVVwcmRYaGlXa0ZvYzAxQ1VXdEVkMjFqUVVGQmIwcEZUME0wYkhGcVJqbDNVSFk0VTFGUUwycHpVV1pLUTFWSWNtcHdXRFJtVUFvZ0lDQWdJQ0FnSURCT2RGWjVjV3hEY25FeFQyMU1VRGRDVEhKWWNrTjRiMEZHVW1JMk5GbEtWV1JYYXpWUU16VnJPWGRxTWtKUmFuQnFZMDVxTW1sck9EQkdiMjh3TWtVS0lDQWdJQ0FnSUNCNVl5dFFlbGN2TkhSNlZuWmtlRkp5UlhwelQwWnRLMjFOVWl0c2JGVklRVXQ2UW1FMlVVSjRTRlF3YjJaTU4zQTFXRmxVZFUxT2JsbHZLMUJxVmsxdENpQWdJQ0FnSUNBZ2FsQXpWRVZLUjFsWVdXMTFhRWRtWVdGS1duQnFURzFLUm5Gd05UbDRMeTlrYzAxSVpVeHhWVU5vZDJJMlEyYzJSSFZyUVdsb1pVRnpNMUFyY2xodk13b2dJQ0FnSUNBZ0lIUkNia0UwU2tORGFWaFNOeTh2TUZkbGVsSnZVMUJrWVd4T1pXMDBkbk00VUZRNE4zTnVTR0pFYkdsR1RWWm1PSGNyWm10elNXNXhkbTkwYVZKRVNUUUtJQ0FnSUNBZ0lDQlJRbkpDWm5NelRtUmxXbGN2ZEcxMWNFOWhXa3BTZWtoRWRuWkxZbWN2TDA4MmFYQXhZVkIyU1V4WGRsUkVUVGhMWTFGRFVVVlRZVmRyUTJKSk1YVmpDaUFnSUNBZ0lDQWdjbWw2UVUxaWJGUkNNbWQ1ZHpsNWIycERjRlpEVFVKWVpHbDZRWEZ4ZVd3MVdsWnlkelFyV0M5cE1EbEpjMDUwT0doQk9TODFVbGszZGpOak4xb3lRd29nSUNBZ0lDQWdJRmg1TW5oTFYyMTBURWs1Ym14UFUxTjNWWGhDTlRZMlNUSTViRlpMUWt4VmJWaHRVV1p1VWtsSlNFTnBTa1JZV1VaRVVDODJUR1oyT1N0dGFFVlhWVGdLSUNBZ0lDQWdJQ0J4WldRemVHaHdaVTVUUVVsNlFTdE5WR3hxZEdsU2JXOXllSEJrWkdsWVluUkRZV1pqVUd3dlNqTllNRUl3TjJaalkwcGFkMXB6UTFsRGNIUk1lVEZqQ2lBZ0lDQWdJQ0FnZVhaV1lVNHJSVUp0YW05RGNETnFkRFozVEdVMGVHTnNjVlV6UVVOM2VpODRWRVJFYlhSS04xVlZaR3czVFdScmFYQlJXakkzT0V3eWEzQnNObTgyTVFvZ0lDQWdJQ0FnSUUxR01tWllSRGRtV2sxbFdtWkZkelpzZFRCQ1JqVnRXakF2WTJnelNIaFlaVnB2V0dsbU56bG5NalYyV20xVFpGYzVOM0JqWldWM1VHeDJiRVZVUmxFS0lDQWdJQ0FnSUNBMU5YQk5iM0pSZVZWVVJWRkRVVE5GUTNwSVdWTnVUQzlVYlZjM0NpQWdJQ0FnSUNBZ1BTc3dVbU1LSUNBZ0lDQWdJQ0F0TFMwdExVVk9SQ0JRUjFBZ1VGVkNURWxESUV0RldTQkNURTlEU3kwdExTMHRDaUFnSUNBZ0lDSnpiM1Z5WTJVaU9pQWlaR1ZpSUZ0emFXZHVaV1F0WW5rOUpFdEZXVjlHU1V4RlhTQm9kSFJ3Y3pvdkwzSmxiR1ZoYzJVdGFtRnRiWGt1YVc1bWNtRm9iM1Z6WlM1amIyMHZJQ1JTUlV4RlFWTkZDaUFnSUNBZ0lDQWdiV0ZwYmlJS0luQmhZMnRoWjJWZmRYQmtZWFJsSWpvZ2RISjFaUW9pY0dGamEyRm5aWE1pT2dvdElDSndkWEJ3WlhRdFkyOWtaU0lLTFNBaWFXNW1jbUZvYjNWelpTMTBiMjlzYTJsMElnb2ljSFZ3Y0dWMElqb0tJQ0FpWTI5c2JHVmpkR2x2YmlJNklDSndkWEJ3WlhRNElnb2dJQ0pwYm5OMFlXeHNJam9nZEhKMVpRb2dJQ0pwYm5OMFlXeHNYM1I1Y0dVaU9pQWlZV2x2SWdvZ0lDSndZV05yWVdkbFgyNWhiV1VpT2lBaWNIVndjR1YwTFdGblpXNTBJZ29nSUNKemRHRnlkRjl6WlhKMmFXTmxJam9nWm1Gc2MyVUtJbkoxYm1OdFpDSTZDaTBnTFNBaWFXZ3RjSFZ3Y0dWMElnb2dJQzBnSWkwdFpXNTJhWEp2Ym0xbGJuUWlDaUFnTFNBaWNISnZaSFZqZEdsdmJpSUtJQ0F0SUNJdExXVnVkbWx5YjI1dFpXNTBjR0YwYUNJS0lDQXRJQ0o3Y205dmRGOWthWEpsWTNSdmNubDlMMlZ1ZG1seWIyNXRaVzUwY3lJS0lDQXRJQ0l0TFhKdmIzUXRaR2x5WldOMGIzSjVJZ29nSUMwZ0lpOXZjSFF2Y0hWd2NHVjBMV052WkdVaUNpQWdMU0FpTFMxb2FXVnlZUzFqYjI1bWFXY2lDaUFnTFNBaWUzSnZiM1JmWkdseVpXTjBiM0o1ZlM5bGJuWnBjbTl1YldWdWRITXZlMlZ1ZG1seWIyNXRaVzUwZlM5b2FXVnlZUzU1WVcxc0lnb2dJQzBnSWkwdGJXOWtkV3hsTFhCaGRHZ2lDaUFnTFNBaWUzSnZiM1JmWkdseVpXTjBiM0o1ZlM5dGIyUjFiR1Z6SWdvZ0lDMGdJbUZ3Y0d4NUlnb2lkM0pwZEdWZlptbHNaWE1pT2dvdElDSmpiMjUwWlc1MElqb2dmQzBLSUNBZ0lGdGtaV1poZFd4MFhRb2dJQ0FnY21WbmFXOXVQWFZ6TFhkbGMzUXRNUW9nSUNKd1lYUm9Jam9nSWk5eWIyOTBMeTVoZDNNdlkyOXVabWxuSWdvZ0lDSndaWEp0YVhOemFXOXVjeUk2SUNJd05qQXdJZ290SUNKamIyNTBaVzUwSWpvZ2ZBb2dJQ0FnSW5CMWNIQmxkRjlsYm5acGNtOXViV1Z1ZENJNklDSndjbTlrZFdOMGFXOXVJZ29nSUNBZ0luQjFjSEJsZEY5eWIyeGxJam9nSW5kbFluTmxjblpsY2lJS0lDQWljR0YwYUNJNklDSXZaWFJqTDNCMWNIQmxkR3hoWW5NdlptRmpkR1Z5TDJaaFkzUnpMbVF2Y0hWd2NHVjBMbmxoYld3aUNpQWdJbkJsY20xcGMzTnBiMjV6SWpvZ0lqQTJORFFpQ2kwZ0ltTnZiblJsYm5RaU9pQWllMXdpYVdndGNIVndjR1YwWENJNmUxd2laR1ZpZFdkY0lqcG1ZV3h6WlN4Y0ltVnVkbWx5YjI1dFpXNTBjR0YwYUZ3aU9sd2llM0p2YjNSZlpHbHlaV04wYjNKNWZTOWxiblpwY205dWJXVnVkSE5jSWl4Y0ltaHBaWEpoTFdOdmJtWnBaMXdpT2x3aWUzSnZiM1JmWkdseVpXTjBiM0o1ZlM5bGJuWnBjbTl1YldWdWRITXZlMlZ1ZG1seWIyNXRaVzUwZlM5b2FXVnlZUzU1WVcxc1hDSXNYQ0p0YjJSMWJHVXRjR0YwYUZ3aU9sd2llM0p2YjNSZlpHbHlaV04wYjNKNWZTOXRiMlIxYkdWelhDSXNYQ0p5YjI5MExXUnBjbVZqZEc5eWVWd2lPbHdpTDI5d2RDOXdkWEJ3WlhRdFkyOWtaVndpZlgwaUNpQWdJbkJoZEdnaU9pQWlMMlYwWXk5d2RYQndaWFJzWVdKekwyWmhZM1JsY2k5bVlXTjBjeTVrTDJsb0xYQjFjSEJsZEM1cWMyOXVJZ29nSUNKd1pYSnRhWE56YVc5dWN5STZJQ0l3TmpRMElnb05DaTB0VFVsTlJVSlBWVTVFUVZKWkxTME5DZz09XCIgLT4gXCJRMjl1ZEdWdWRDMVVlWEJsT2lCdGRXeDBhWEJoY25RdmJXbDRaV1E3SUdKdmRXNWtZWEo1UFNKTlNVMUZRazlWVGtSQlVsa2lDazFKVFVVdFZtVnljMmx2YmpvZ01TNHdEUW9OQ2kwdFRVbE5SVUpQVlU1RVFWSlpEUXBEYjI1MFpXNTBMVlJ5WVc1elptVnlMVVZ1WTI5a2FXNW5PaUEzWW1sMERRcERiMjUwWlc1MExWUjVjR1U2SUhSbGVIUXZZMnh2ZFdRdFkyOXVabWxuRFFwTmFXMWxMVlpsY25OcGIyNDZJREV1TUEwS0RRb2pZMnh2ZFdRdFkyOXVabWxuQ2lKaGNIUWlPZ29nSUNKemIzVnlZMlZ6SWpvS0lDQWdJQ0pwYm1aeVlXaHZkWE5sSWpvS0lDQWdJQ0FnSW10bGVTSTZJSHdLSUNBZ0lDQWdJQ0F0TFMwdExVSkZSMGxPSUZCSFVDQlFWVUpNU1VNZ1MwVlpJRUpNVDBOTExTMHRMUzBLQ2lBZ0lDQWdJQ0FnYlZGSlRrSkhVemRHZEd0Q1JVRkVSaXRaYlVSbk5sRjJjM1kxVmpaYVVYY3JVV2g0WkZSMmFrMVlaVXhET1ZRMlVrWlNWa1E1TkRkeFMzcDBUazVSYmdvZ0lDQWdJQ0FnSUN0QkwzbDRjSEpNUVcxWE1qVlZkUzh4TVc5RGMzcE9Wa2xKWVZJelQxazRUWFI1YVd4aVEzUjZWV3RDZW5aWFpHeFlNMGgyVkhjNU1VeHdPR0o0VlV3S0lDQWdJQ0FnSUNCRldFOU5PVzV6WTNGUGNrOTJaa0pxWVc1d2JFdEVSVXRRVFZrMmRrbGFNMnR3TVhKVmMwTk9SMHhDVERCNE1rdGFaMVU0TUhWc1VuTk5UVGh4YmtKT0NpQWdJQ0FnSUNBZ2EzQlVhVUZsV0V0UFJWWjBVbnBzVjJ4MlQwWk1TamR3V1VSMllWb3dWV2RJVTFaMVJTdGFhMnhrY1U5a1RFeFNjRXRyWkVsMlNsQmphMWh4VERWNFZBb2dJQ0FnSUNBZ0lGVjJWMVJYTVdWdVJrRklaRFVyVGxGNFRXNURZVE5wYTJwUlZqTkVWR3hGYW5OblRFeFJZbUo1YzFocVdGQnlObEJKVUhNeU9XTlVZMlp2Y1RRek1VOEtJQ0FnSUNBZ0lDQjBValJFY2xwQ05IWk5SVTlCT0RoVWJVdENhMFZwVFVjcmFVSTVZMnA2TlhkQ1NYVk5kVGsxV20xdlNuaGtkbXBRVWpjeVJsbExaM0pEV0U1MFRtaGtDaUFnSUNBZ0lDQWdWbVZ5UlZKMmNFeFVhR1JoVW0xYVoyazNiSGtyUkhacldUZE1jWGxLVUhaa1NHTnhlR1ZrWjBadVVFdFNORlFyWjFOUmJXSlZVR1E1Y1hGa1NsSXdVUW9nSUNBZ0lDQWdJRXRzTDFCdGRIVlRMM2M1WjNreVdqUmhlVEJSU1V0eVRrSjZVWGhvUVRoTVJGcHdjREZ5ZFdaRFNqVXJXazFsWmprd2RraHdkM2hOSzA5aFVISjVUbXdLSUNBZ0lDQWdJQ0JGWkVSWE4xbFJPR1oxUWpWdVVIRnFkMVZCY0cxc1dWbE1TbGxzWkRkMlNqYzVSVWw0TDNOcVoyZzJSeXRKUm1sdE4zaFNOMWRwVVVZdmJrcGxkbVp4Q2lBZ0lDQWdJQ0FnZG5wWlR6ZHZjaTlIU1VOaU5tVmFkM1pRWkhSNU56bEliVlpsVUhGRlZHeEVWVEF3YjNsdmNGZDVWSE5aZVZOWlJGTkliaTgwWkc5VWRYZzRkaXRHTHdvZ0lDQWdJQ0FnSUZsbGVXSjJaM0ZpY21sSU4ybFRSamhJZUhkRlJtVkVhbkpOZEZWVVNITllRek0xUkVoR1pVMURhRXB2ZUhONVMzWTBPRW9yWWtsSFJuZEJVa0ZSUVVJS0lDQWdJQ0FnSUNCMFF6RktZbTFhZVZsVmFIWmtXRTVzU1VaQ2FGa3lkR2hhTWxaNVNVUjRkMWxYVG5KWlYyUnNZMnRDY0dKdFdubFpWMmgyWkZoT2JFeHRUblppVkRaS0NpQWdJQ0FnSUNBZ1FXeFJSVVYzUlV0QlJEUlhTVkZUYVU1b05XdFpNM2M0VnpCblFVWTRXR2QxU21GdmVHWmpSRGQzVlVOYVRITlhNbEZKWWtGM1ZVcEJPRXB1UVVGVlRBb2dJQ0FnSUNBZ0lFTlJaMGhCWjFsV1EyZHJTVU4zU1VWR1owbEVRVkZKWlVGUlNWaG5RVUZMUTFKRVozVktZVzk0Wm1ORU4zZGlOMFF2T1dWdVluUlBNVVJGVVc0eFVIUUtJQ0FnSUNBZ0lDQm9aMnQwU0N0SmNtSkNaRmxTU0dzM01XbHNNbWhpYm0xQlltOU1hMnN4WVdzdllXRlJXUzlZVVVSS1JtaHlRVGRxVFd0UVRFOURVbVZ2ZEVocFVXMTJDaUFnSUNBZ0lDQWdNVlZtY1VSalRUSmxVVFF2ZURCT09VWXlSRXhWVTJ0MWQzY3hNVGQyZEhSVmIwSjRhWEpDTnpKd1R6QlVMMnhrT1c4ek9WTklUVU12Ukdack5uazJhQW9nSUNBZ0lDQWdJSFJVUjNGNFRHZG9PR296UkZONVR6VkZSWEpLVEdFdk0wSjJUWEZ5TkdseFlqTlFWSGRPWlVSU1JXcGhkbEZLYUZoVGRrVkdhbmxCUTI5dk9XUTNjbk1LSUNBZ0lDQWdJQ0EzYkdoRFltSlRVR3BuVkdOSEwxQkRabnBNY2pNM1VYbDZXR2xVVWk5VWQycHBkMVprVkdoa1ExTXZRMHR1YzI5Tk9HNW5TSGhxV0Zsd1N6ZE5ObmRuQ2lBZ0lDQWdJQ0FnZEhwQk9FcHJTRnB5TlUxd2EzSlFSM0puVVdWMmFFcENUR3RJVWk5cVkzTmhZVUphVGpkdWR6aGhaVWhqZDNkTk5DOURhRWhKZVZwa1VUa3hNRFU1Y0FvZ0lDQWdJQ0FnSUU5TllWbHRWMjFxVUZGbWNURnlUMjVCUVhaQk1YaFhkeXRVV2s1NlNHZFhTWEUwZG5WemVEZFBRblp5Um5OV1pWcE9jM0ZrTjA5aE5IQnlkRlpYWnpBS0lDQWdJQ0FnSUNBNU1XTkxXa3B2TDA5Mk5tOXdUUzkzUkZkT01ubENibXR0UWtOM1lWaHdiMGcxVGtSUk1qSmlhRzVIVkVwbFNWZGtaV2s0VlZOSGNIWkNhMVI0UWtreUNpQWdJQ0FnSUNBZ1dETXljSGxQYlZwRWJqZ3hUREo2VFRKcGIwNTJaMWhKWWpWMU5YUnFZamxPVDJsQmREWnZWekJITUhnd01HUm5jak55Tm5CMU9IRnRUWGRyUWxaQ1F3b2dJQ0FnSUNBZ0lIWlhkMFZ0WVhoUmJtdFVhRzVpUVdRMU4xWmlZWFEwTHk5MVJHTklSbkJFWVVKUWNFWlhaVU5NTW1SbVJGTnlVemxwYVVzMlN6RldhM1pIVEc5WWFEZ0tJQ0FnSUNBZ0lDQk5jRXB4YW05a1pIQm1UbWcwZFhsbWVrdDVUa1V4WkhKUk1qbHRZM2RtU1d4NldHOVFjbUl3T1ZjMldraHdiU3QwY1dRNFRXczNNRGQ2ZDNOa1JrZFNDaUFnSUNBZ0lDQWdjVkp6ZUcxMFVHNDVTakZ5WlZsYWFWWjFSVFZITWpabU1XRkxWRkkzYTBORVVWSnJkWGhpV2tGU1FVRTBLemxyYmpSemJVSllXbU5OTUhaR2NUbFNPQW9nSUNBZ0lDQWdJREkwV0V0YWRGUmhWbTFXYjFaS1RWSlJUVFEwY1ZkU0szTXZVekJOZW5aaVR6VjFNR05UVmxSb1dUWTFXWHBOVEhNNU1qQlZXVFoxUjNCdlV6SmFXWGNLSUNBZ0lDQWdJQ0JKVFdsd2EyRkNLekpHTmtJNFVqZFdOMjVzTDFObllWaEhZVEpOWlhoclF6ZDNkRFppYkVaaVlYYzNjR0oyU1N0cFNUbDNVemhDUzBoblRVUjZaREJHQ2lBZ0lDQWdJQ0FnVkdwVGNUbDJaR3RXYTJZM2VVa3phRVYzYkd4WU4zcFVOa2xNVDNacmJrNUhZbTl6TUdSR1NUa3lZMEpYVVhNcmFWaFFOVEI0UkZacGRETXJPVzFEUkFvZ0lDQWdJQ0FnSUhKMVYxWlphemN6YlhaVFJYcEdZM1ZZUTNsaVMwbzFWUzl1ZWxOUk56QktiMUZ0VTFCak5UQlNVV3AxU0Vka2Vtd3ZXWHBIUm1GR2JqVjZTVm8xY0ZBS0lDQWdJQ0FnSUNCck5WTXJTMVJaWld0NlkybFNhMGg2WW1WaE5WQnFLMEUyUzFwcGJFdHFOWGxyUVZKR2VuY3JRMUI0Y1hOMVpXcEVhMmszUVN0aE0yMHpWMGR4SzIxdENpQWdJQ0FnSUNBZ1FXdHNVVFJaUW1OdmJIcE9UM0JuVjJOc1NWTjFSVE5rTld0bmRHRktRVU5KWjNSbE9EZEdObEZDUW5Ock9HOUVRa1pSUTI1YWJXOVBhWEpzVTJ4aVpnb2dJQ0FnSUNBZ0lFcDFSRFptVmtOS2RUSjZXVGRVYUU0eFR6QnZWMVIzUVdGT1FYWk5OVFZEVEZSMk5uTXpSbTEwVWpreWJHNXNVVVJHZFVvclptbzROak5qTm5GNE1UUUtJQ0FnSUNBZ0lDQkdkVTgwYlUwM1pYVlRNRGgzUjJkV1IyMDVNWGRCTjJKWmJEUmhhSGhETmxNeVFrZENOVVoyYTFwbWVrSkNkMnB6Wm0xVlYwaEJkVGRXVWxwS2VHdFlDaUFnSUNBZ0lDQWdTbkEyT1RaUFZHUlNNMUptU1RkSldqWlBWelowUjBWTWFXcHpkMWRpWWxwWVlqVllVbGRGVnprNWRsZFBOMDVKU3paelQzWm9UVVJPY0RsaVUwMTFZZ29nSUNBZ0lDQWdJRmhRTTFCaVVIaG5lVlF3WW0xemN6QjVkMDVaZDNWamJtWmpiVVJZY1ZCV2RUTkhaSFExTTJGME1TdG9TemR0Ykc1Uk0zVlZjelZsVmtWUFNVaHVTbTBLSUNBZ0lDQWdJQ0JtTVhSeVJHZG5VMVJGTjJadWEzZzJRM3BzSzJsTmEwRkZVVVZCUVZsclExQkJVVmxCVVc5QlNtaFphRUpMU1RKSWJWSnFaa1I0WWxOQlFWaDRaVU0wQ2lBZ0lDQWdJQ0FnYkhGcVJqbDNVSFpDVVVwcmRYaGlXa0ZvYzAxQ1VXdEVkMjFqUVVGQmIwcEZUME0wYkhGcVJqbDNVSFk0VTFGUUwycHpVV1pLUTFWSWNtcHdXRFJtVUFvZ0lDQWdJQ0FnSURCT2RGWjVjV3hEY25FeFQyMU1VRGRDVEhKWWNrTjRiMEZHVW1JMk5GbEtWV1JYYXpWUU16VnJPWGRxTWtKUmFuQnFZMDVxTW1sck9EQkdiMjh3TWtVS0lDQWdJQ0FnSUNCNVl5dFFlbGN2TkhSNlZuWmtlRkp5UlhwelQwWnRLMjFOVWl0c2JGVklRVXQ2UW1FMlVVSjRTRlF3YjJaTU4zQTFXRmxVZFUxT2JsbHZLMUJxVmsxdENpQWdJQ0FnSUNBZ2FsQXpWRVZLUjFsWVdXMTFhRWRtWVdGS1duQnFURzFLUm5Gd05UbDRMeTlrYzAxSVpVeHhWVU5vZDJJMlEyYzJSSFZyUVdsb1pVRnpNMUFyY2xodk13b2dJQ0FnSUNBZ0lIUkNia0UwU2tORGFWaFNOeTh2TUZkbGVsSnZVMUJrWVd4T1pXMDBkbk00VUZRNE4zTnVTR0pFYkdsR1RWWm1PSGNyWm10elNXNXhkbTkwYVZKRVNUUUtJQ0FnSUNBZ0lDQlJRbkpDWm5NelRtUmxXbGN2ZEcxMWNFOWhXa3BTZWtoRWRuWkxZbWN2TDA4MmFYQXhZVkIyU1V4WGRsUkVUVGhMWTFGRFVVVlRZVmRyUTJKSk1YVmpDaUFnSUNBZ0lDQWdjbWw2UVUxaWJGUkNNbWQ1ZHpsNWIycERjRlpEVFVKWVpHbDZRWEZ4ZVd3MVdsWnlkelFyV0M5cE1EbEpjMDUwT0doQk9TODFVbGszZGpOak4xb3lRd29nSUNBZ0lDQWdJRmg1TW5oTFYyMTBURWs1Ym14UFUxTjNWWGhDTlRZMlNUSTViRlpMUWt4VmJWaHRVV1p1VWtsSlNFTnBTa1JZV1VaRVVDODJUR1oyT1N0dGFFVlhWVGdLSUNBZ0lDQWdJQ0J4WldRemVHaHdaVTVUUVVsNlFTdE5WR3hxZEdsU2JXOXllSEJrWkdsWVluUkRZV1pqVUd3dlNqTllNRUl3TjJaalkwcGFkMXB6UTFsRGNIUk1lVEZqQ2lBZ0lDQWdJQ0FnZVhaV1lVNHJSVUp0YW05RGNETnFkRFozVEdVMGVHTnNjVlV6UVVOM2VpODRWRVJFYlhSS04xVlZaR3czVFdScmFYQlJXakkzT0V3eWEzQnNObTgyTVFvZ0lDQWdJQ0FnSUUxR01tWllSRGRtV2sxbFdtWkZkelpzZFRCQ1JqVnRXakF2WTJnelNIaFlaVnB2V0dsbU56bG5NalYyV20xVFpGYzVOM0JqWldWM1VHeDJiRVZVUmxFS0lDQWdJQ0FnSUNBMU5YQk5iM0pSZVZWVVJWRkRVVE5GUTNwSVdWTnVUQzlVYlZjM0NpQWdJQ0FnSUNBZ1BTc3dVbU1LSUNBZ0lDQWdJQ0F0TFMwdExVVk9SQ0JRUjFBZ1VGVkNURWxESUV0RldTQkNURTlEU3kwdExTMHRDaUFnSUNBZ0lDSnpiM1Z5WTJVaU9pQWlaR1ZpSUZ0emFXZHVaV1F0WW5rOUpFdEZXVjlHU1V4RlhTQm9kSFJ3Y3pvdkwzSmxiR1ZoYzJVdGFtRnRiWGt1YVc1bWNtRm9iM1Z6WlM1amIyMHZJQ1JTUlV4RlFWTkZDaUFnSUNBZ0lDQWdiV0ZwYmlJS0luQmhZMnRoWjJWZmRYQmtZWFJsSWpvZ2RISjFaUW9pY0dGamEyRm5aWE1pT2dvdElDSndkWEJ3WlhRdFkyOWtaU0lLTFNBaWFXNW1jbUZvYjNWelpTMTBiMjlzYTJsMElnb3RJQ0pwYm1aeVlXaHZkWE5sTFhCMWNIQmxkQzFrWVhSaElnb2ljSFZ3Y0dWMElqb0tJQ0FpWTI5c2JHVmpkR2x2YmlJNklDSndkWEJ3WlhRNElnb2dJQ0pwYm5OMFlXeHNJam9nZEhKMVpRb2dJQ0pwYm5OMFlXeHNYM1I1Y0dVaU9pQWlZV2x2SWdvZ0lDSndZV05yWVdkbFgyNWhiV1VpT2lBaWNIVndjR1YwTFdGblpXNTBJZ29nSUNKemRHRnlkRjl6WlhKMmFXTmxJam9nWm1Gc2MyVUtJbkoxYm1OdFpDSTZDaTBnTFNBaWFXZ3RjSFZ3Y0dWMElnb2dJQzBnSWkwdFpXNTJhWEp2Ym0xbGJuUWlDaUFnTFNBaWNISnZaSFZqZEdsdmJpSUtJQ0F0SUNJdExXVnVkbWx5YjI1dFpXNTBjR0YwYUNJS0lDQXRJQ0o3Y205dmRGOWthWEpsWTNSdmNubDlMMlZ1ZG1seWIyNXRaVzUwY3lJS0lDQXRJQ0l0TFhKdmIzUXRaR2x5WldOMGIzSjVJZ29nSUMwZ0lpOXZjSFF2Y0hWd2NHVjBMV052WkdVaUNpQWdMU0FpTFMxb2FXVnlZUzFqYjI1bWFXY2lDaUFnTFNBaUwyOXdkQzlwYm1aeVlXaHZkWE5sTFhCMWNIQmxkQzFrWVhSaEwyVnVkbWx5YjI1dFpXNTBjeTl3Y205a2RXTjBhVzl1TDJocFpYSmhMbmxoYld3aUNpQWdMU0FpTFMxdGIyUjFiR1V0Y0dGMGFDSUtJQ0F0SUNKN2NtOXZkRjlrYVhKbFkzUnZjbmw5TDIxdlpIVnNaWE1pQ2lBZ0xTQWlZWEJ3YkhraUNpSjNjbWwwWlY5bWFXeGxjeUk2Q2kwZ0ltTnZiblJsYm5RaU9pQjhMUW9nSUNBZ1cyUmxabUYxYkhSZENpQWdJQ0J5WldkcGIyNDlkWE10ZDJWemRDMHhDaUFnSW5CaGRHZ2lPaUFpTDNKdmIzUXZMbUYzY3k5amIyNW1hV2NpQ2lBZ0luQmxjbTFwYzNOcGIyNXpJam9nSWpBMk1EQWlDaTBnSW1OdmJuUmxiblFpT2lCOENpQWdJQ0FpY0hWd2NHVjBYMlZ1ZG1seWIyNXRaVzUwSWpvZ0luQnliMlIxWTNScGIyNGlDaUFnSUNBaWNIVndjR1YwWDNKdmJHVWlPaUFpZDJWaWMyVnlkbVZ5SWdvZ0lDSndZWFJvSWpvZ0lpOWxkR012Y0hWd2NHVjBiR0ZpY3k5bVlXTjBaWEl2Wm1GamRITXVaQzl3ZFhCd1pYUXVlV0Z0YkNJS0lDQWljR1Z5YldsemMybHZibk1pT2lBaU1EWTBOQ0lLTFNBaVkyOXVkR1Z1ZENJNklDSjdYQ0pwYUMxd2RYQndaWFJjSWpwN1hDSmtaV0oxWjF3aU9tWmhiSE5sTEZ3aVpXNTJhWEp2Ym0xbGJuUndZWFJvWENJNlhDSjdjbTl2ZEY5a2FYSmxZM1J2Y25sOUwyVnVkbWx5YjI1dFpXNTBjMXdpTEZ3aWFHbGxjbUV0WTI5dVptbG5YQ0k2WENJdmIzQjBMMmx1Wm5KaGFHOTFjMlV0Y0hWd2NHVjBMV1JoZEdFdlpXNTJhWEp2Ym0xbGJuUnpMM0J5YjJSMVkzUnBiMjR2YUdsbGNtRXVlV0Z0YkZ3aUxGd2liVzlrZFd4bExYQmhkR2hjSWpwY0ludHliMjkwWDJScGNtVmpkRzl5ZVgwdmJXOWtkV3hsYzF3aUxGd2ljbTl2ZEMxa2FYSmxZM1J2Y25sY0lqcGNJaTl2Y0hRdmNIVndjR1YwTFdOdlpHVmNJbjE5SWdvZ0lDSndZWFJvSWpvZ0lpOWxkR012Y0hWd2NHVjBiR0ZpY3k5bVlXTjBaWEl2Wm1GamRITXVaQzlwYUMxd2RYQndaWFF1YW5OdmJpSUtJQ0FpY0dWeWJXbHpjMmx2Ym5NaU9pQWlNRFkwTkNJS0RRb3RMVTFKVFVWQ1QxVk9SRUZTV1MwdERRbz1cIiUwQSAgICAgICAgIyAoMTEgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSUwQSAgICAgICAgIyAoMiB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfbGJfbGlzdGVuZXIuc3NsIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19sYl9saXN0ZW5lclwiIFwic3NsXCIgeyUwQSAgICAgIH4gY2VydGlmaWNhdGVfYXJuICAgPSBcImFybjphd3M6YWNtOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvN2Y1MDFhM2UtZTkzYS00ZDk3LTk5ZTMtYzZiZjU3M2M1OWJlXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgaWQgICAgICAgICAgICAgICAgPSBcImFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsaXN0ZW5lci9hcHAvd2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgvMDNhNjRiOGZjOWYwZjA1NS80NmFmYWE3MTJhZTlmYjcwXCIlMEEgICAgICAgIHRhZ3MgICAgICAgICAgICAgID0ge30lMEEgICAgICAgICMgKDYgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSUwQSAgICAgICAgIyAoMSB1bmNoYW5nZWQgYmxvY2sgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS53ZWJzaXRlLmF3c19yb3V0ZTUzX3JlY29yZC5hcGV4WzBdIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19yb3V0ZTUzX3JlY29yZFwiIFwiYXBleFwiIHslMEEgICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJaMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fQVwiJTBBICAgICAgICBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS5jb21cIiUwQSAgICAgIH4gcmVjb3JkcyAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbJTBBICAgICAgICAgIC0gXCIxMy41Ny4xMTEuNzdcIiwlMEEgICAgICAgICAgLSBcIjU0LjI0MS4xMzQuMjAzXCIsJTBBICAgICAgICBdIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICMgKDUgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS53ZWJzaXRlLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJpbmZyYWhvdXNlLmNvbVwiXSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3Nfcm91dGU1M19yZWNvcmRcIiBcImNlcnRfdmFsaWRhdGlvblwiIHslMEEgICAgICArIGFsbG93X292ZXJ3cml0ZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGZxZG4gICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJlY29yZHMgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHR0bCAgICAgICAgICAgICA9IDYwJTBBICAgICAgKyB0eXBlICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB6b25lX2lkICAgICAgICAgPSBcIlowNzY2MjI1MUxIM1lSRjJFUk0zR1wiJTBBICAgIH0lMEElMEFQbGFuOiAzIHRvIGFkZCwgNCB0byBjaGFuZ2UsIDEgdG8gZGVzdHJveS4lMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMFxuIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogMywgImNoYW5nZSI6IDQsICJkZXN0cm95IjogMX19```
</p></details>